src/aoc2024.org
#+title: Advent of Code 2024 in Common Lisp
#+options: toc:nil num:0

[[./index.html][Home]]

#+toc: headlines 2

** Day 1
:PROPERTIES:
:CUSTOM_ID: day-1
:END:
#+begin_src lisp
  (defun parse-input (lines)
    "Transforms the lists provided as two colums into two LISP lists."
    (values
     (mapcar #'(lambda (collection) (parse-integer (first (remove "" (split-by-one-space collection) :test #'string=)))) lines)
     (mapcar #'(lambda (collection) (parse-integer (second (remove "" (split-by-one-space collection) :test #'string=)))) lines)))

  (defun read-and-parse-input (input-file)
    (parse-input (uiop:read-file-lines input-file)))

  ;; from https://lispcookbook.github.io/cl-cookbook/strings.html#breaking-strings-into-graphenes-sentences-lines-and-words
  (defun split-by-one-space (string)
    (loop for i = 0 then (1+ j)
	  as j = (position #\Space string :start i)
	  collect (subseq string i j)
	  while j))

  (defun total-distance (list-1 list-2)
    (let ((sorted-1 (sort (copy-seq list-1) #'<))
	  (sorted-2 (sort (copy-seq list-2) #'<)))
      (reduce #'+ (mapcar #'(lambda (x y) (abs (- x y))) sorted-1 sorted-2))))

  (defun total-similarity (list-1 list-2)
    (let ((occurrences (make-hash-table)))
      (dolist (item list-1)
	(setf (gethash item occurrences) 0))
      (dolist (item list-2)
	(when (gethash item occurrences) (incf (gethash item occurrences))))
      (reduce #'+ (mapcar #'(lambda (item) (* item (gethash item occurrences))) list-1))))

  (defun main ()
    (multiple-value-bind (x y) (read-and-parse-input "input")
      (format t "~a~%" (total-similarity x y))
      (format t "~a~%" (total-distance x y))))
  #+end_src

#+RESULTS:
: MAIN

** Day 2
:PROPERTIES:
:CUSTOM_ID: day-2
:END:
In =utils.lisp= I'll move general functions defined over the AOC and
that could be useful for the next days.

#+begin_src lisp
  (load "../utils.lisp")

  (defparameter *test*'((7 6 4 2 1)
			(1 2 7 8 9)
			(9 7 6 2 1)
			(1 3 2 4 5)
			(8 6 4 4 1)
			(1 3 6 7 9)))

  (defun parse-file (lines)
    (mapcar #'(lambda (line) (mapcar #'parse-integer (utils:split-by-one-space line))) lines))

  (defun read-and-parse-file (input-file)
    (parse-file (uiop:read-file-lines input-file)))


  (defun check-pairs (sequence &optional (comparison-func #'<=))
    (loop for i from 1 below (length sequence) do
      (unless (funcall comparison-func (nth (1- i) sequence) (nth i sequence))
	(return-from check-pairs nil)))
    t)

  (defun pair-distance-ok-p (x y &optional (min-distance 1) (max-distance 3))
    (let ((diff (abs (- x y))))
      (and (>= diff min-distance) (<= diff max-distance) )))

  (defun distance-ok-p (sequence &optional (min-distance 1) (max-distance 3))
    (check-pairs sequence #'(lambda (x y) (pair-distance-ok-p x y min-distance max-distance))))

  (defun check-safety (sequence)
    "A sequence of numbers is safe if it is monotonically decreasing or
    increasing, and any adjacent numbers differ by at least one and at
    most three."
    (cond ((< (first sequence) (second sequence))
	   (check-pairs sequence #'increasing-and-distance-p))
	  ((> (first sequence) (second sequence))
	   (check-pairs sequence #'decreasing-and-distance-p))
	  (t nil)))

  (defun increasing-and-distance-p (x y)
    (and (< x y) (pair-distance-ok-p x y)))

  (defun decreasing-and-distance-p (x y)
    (and (> x y) (pair-distance-ok-p x y)))

  (defun sequences-without-one-element (sequence)
    (loop for i from 0 below (length sequence) collect
					       (append (subseq sequence 0 i) (subseq sequence (1+ i) (length sequence)))))

  (defun solve (input-file)
    (let ((sequences (read-and-parse-file input-file)))
      (format t "~a~%" (solve-first sequences))
      (format t "~a~%" (solve-second sequences))))

  (defun solve-first (sequences)
    (reduce #'+ (mapcar #'(lambda (seq) (if (check-safety seq) 1 0)) sequences)))

  (defun solve-second (sequences)
    (reduce #'+ (mapcar #'(lambda (seq) (if (some #'check-safety (sequences-without-one-element seq)) 1 0)) sequences)))
#+end_src

** Day 3
:PROPERTIES:
:CUSTOM_ID: day-3
:END:
