dist/aoc2024.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advent of Code 2024 in Common Lisp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
                  href="./style.css" type="text/css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Advent of Code 2024 in Common Lisp</h1>
<p>
<a href="./index.html">Home</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#day-1">Day 1</a></li>
<li><a href="#day-2">Day 2</a></li>
<li><a href="#day-3">Day 3</a>
<ul>
<li><a href="#easy-sane-version">Easy, sane version</a></li>
<li><a href="#the-hard-way">The hard way</a></li>
</ul>
</li>
<li><a href="#day-4">Day 4</a></li>
<li><a href="#day-5">Day 5</a></li>
<li><a href="#day-6">Day 6</a></li>
<li><a href="#day-7">Day 7</a></li>
<li><a href="#day-8">Day 8</a></li>
<li><a href="#day-9">Day 9</a></li>
<li><a href="#orgd1b4882">Day 10</a></li>
<li><a href="#orgb7d178a">Day 11</a></li>
<li><a href="#org66d93fb">Day 12</a></li>
<li><a href="#orgf8fd1e4">Day 13</a></li>
<li><a href="#utils">Utils</a></li>
</ul>
</div>
</div>
<div id="outline-container-day-1" class="outline-2">
<h2 id="day-1">Day 1</h2>
<div class="outline-text-2" id="text-day-1">
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">parse-input</span> (lines)
  <span class="org-doc">"Transforms the lists provided as two colums into two LISP lists."</span>
  (values
   (mapcar #'(<span class="org-keyword">lambda</span> (collection) (parse-integer (first (remove <span class="org-string">""</span> (split-by-one-space collection) <span class="org-builtin">:test</span> #'string=)))) lines)
   (mapcar #'(<span class="org-keyword">lambda</span> (collection) (parse-integer (second (remove <span class="org-string">""</span> (split-by-one-space collection) <span class="org-builtin">:test</span> #'string=)))) lines)))

(<span class="org-keyword">defun</span> <span class="org-function-name">read-and-parse-input</span> (input-file)
  (parse-input (uiop:read-file-lines input-file)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">from https://lispcookbook.github.io/cl-cookbook/strings.html#breaking-strings-into-graphenes-sentences-lines-and-words</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">split-by-one-space</span> (string)
  (<span class="org-keyword">loop</span> for i = 0 then (1+ j)
          as j = (position #\Space string <span class="org-builtin">:start</span> i)
          collect (subseq string i j)
          while j))

(<span class="org-keyword">defun</span> <span class="org-function-name">total-distance</span> (list-1 list-2)
  (<span class="org-keyword">let</span> ((sorted-1 (sort (copy-seq list-1) #'&lt;))
          (sorted-2 (sort (copy-seq list-2) #'&lt;)))
    (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (x y) (abs (- x y))) sorted-1 sorted-2))))

(<span class="org-keyword">defun</span> <span class="org-function-name">total-similarity</span> (list-1 list-2)
  (<span class="org-keyword">let</span> ((occurrences (make-hash-table)))
    (<span class="org-keyword">dolist</span> (item list-1)
        (setf (gethash item occurrences) 0))
    (<span class="org-keyword">dolist</span> (item list-2)
        (<span class="org-keyword">when</span> (gethash item occurrences) (incf (gethash item occurrences))))
    (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (item) (* item (gethash item occurrences))) list-1))))

(<span class="org-keyword">defun</span> <span class="org-function-name">main</span> ()
  (<span class="org-keyword">multiple-value-bind</span> (x y) (read-and-parse-input <span class="org-string">"input"</span>)
    (format t <span class="org-string">"~a~%"</span> (total-similarity x y))
    (format t <span class="org-string">"~a~%"</span> (total-distance x y))))
</pre>
</div>
</div>
</div>
<div id="outline-container-day-2" class="outline-2">
<h2 id="day-2">Day 2</h2>
<div class="outline-text-2" id="text-day-2">
<p>
In <code>utils.lisp</code> I'll move general functions defined over the AOC and
that could be useful for the next days.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*test*</span>'((7 6 4 2 1)
                        (1 2 7 8 9)
                        (9 7 6 2 1)
                        (1 3 2 4 5)
                        (8 6 4 4 1)
                        (1 3 6 7 9)))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-file</span> (lines)
  (mapcar #'(<span class="org-keyword">lambda</span> (line) (mapcar #'parse-integer (utils:split-by-one-space line))) lines))

(<span class="org-keyword">defun</span> <span class="org-function-name">read-and-parse-file</span> (input-file)
  (parse-file (uiop:read-file-lines input-file)))


(<span class="org-keyword">defun</span> <span class="org-function-name">check-pairs</span> (sequence <span class="org-type">&amp;optional</span> (comparison-func #'&lt;=))
  (<span class="org-keyword">loop</span> for i from 1 below (length sequence) do
    (<span class="org-keyword">unless</span> (funcall comparison-func (nth (1- i) sequence) (nth i sequence))
        (<span class="org-keyword">return-from</span> check-pairs nil)))
  t)

(<span class="org-keyword">defun</span> <span class="org-function-name">pair-distance-ok-p</span> (x y <span class="org-type">&amp;optional</span> (min-distance 1) (max-distance 3))
  (<span class="org-keyword">let</span> ((diff (abs (- x y))))
    (and (&gt;= diff min-distance) (&lt;= diff max-distance) )))

(<span class="org-keyword">defun</span> <span class="org-function-name">distance-ok-p</span> (sequence <span class="org-type">&amp;optional</span> (min-distance 1) (max-distance 3))
  (check-pairs sequence #'(<span class="org-keyword">lambda</span> (x y) (pair-distance-ok-p x y min-distance max-distance))))

(<span class="org-keyword">defun</span> <span class="org-function-name">check-safety</span> (sequence)
  <span class="org-doc">"A sequence of numbers is safe if it is monotonically decreasing or</span>
<span class="org-doc">  increasing, and any adjacent numbers differ by at least one and at</span>
<span class="org-doc">  most three."</span>
  (<span class="org-keyword">cond</span> ((&lt; (first sequence) (second sequence))
           (check-pairs sequence #'increasing-and-distance-p))
          ((&gt; (first sequence) (second sequence))
           (check-pairs sequence #'decreasing-and-distance-p))
          (t nil)))

(<span class="org-keyword">defun</span> <span class="org-function-name">increasing-and-distance-p</span> (x y)
  (and (&lt; x y) (pair-distance-ok-p x y)))

(<span class="org-keyword">defun</span> <span class="org-function-name">decreasing-and-distance-p</span> (x y)
  (and (&gt; x y) (pair-distance-ok-p x y)))

(<span class="org-keyword">defun</span> <span class="org-function-name">sequences-without-one-element</span> (sequence)
  (<span class="org-keyword">loop</span> for i from 0 below (length sequence) collect
                                               (append (subseq sequence 0 i) (subseq sequence (1+ i) (length sequence)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve</span> (input-file)
  (<span class="org-keyword">let</span> ((sequences (read-and-parse-file input-file)))
    (format t <span class="org-string">"~a~%"</span> (solve-first sequences))
    (format t <span class="org-string">"~a~%"</span> (solve-second sequences))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-first</span> (sequences)
  (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (seq) (<span class="org-keyword">if</span> (check-safety seq) 1 0)) sequences)))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-second</span> (sequences)
  (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (seq) (<span class="org-keyword">if</span> (some #'check-safety (sequences-without-one-element seq)) 1 0)) sequences)))
</pre>
</div>
</div>
</div>
