src/aoc2024.org
*** Easy, sane version
:PROPERTIES:
:CUSTOM_ID: easy-sane-version
:END:
<<sec:day-3>>

Just use =grep= to pre-process the file, or an available regex library.

- 3.1: =grep "mul([0-9][0-9]*,[0-9][0-9]*)" input > preprocessed-1=
- 3.2:
  =grep -e "mul([0-9][0-9]*,[0-9][0-9]*) -e "do()" -e "don't()" input > preprocessed-2=

Then do the parsing and calculations in CL:

#+begin_src lisp

  (defun get-valid-muls (mixed &optional (valid-region t))
    (let ((valid '()) (valid-region valid-region))
      (loop for string in mixed do
	(cond
	  ((string= string "do()") (setq valid-region t))
	  ((string= string "don't()") (setq valid-region nil))
	  (valid-region (setq valid (append valid (list string))))))
      (values valid valid-region)))

  (defun parse-mul (mul-string)
    (let* ((comma (position "," mul-string :test #'string=))
	   (left (parse-integer (subseq mul-string 4 comma)))
	   (right (parse-integer
		   (subseq mul-string (1+ comma) (position ")" mul-string :test #'string=)))))
      (* left right)))

  (defun mul-and-add-line (mul-line)
    (reduce #'+ (mapcar #'parse-mul mul-line)))

  (defun parse-mul (mul-string)
    (let* ((comma (position "," mul-string :test #'string=))
	   (left (parse-integer (subseq mul-string 4 comma)))
	   (right (parse-integer (subseq mul-string (1+ comma) (position ")" mul-string :test #'string=)))))
      (* left right)))

  (defun solve-1-preprocessed (file)
    (let* ((line (uiop:read-file-lines file)))
      (mul-and-add-line line)))

  (defun solve-2-preprocessed (file)
    (let ((line (get-valid-muls (uiop:read-file-lines file))))
      (mul-and-add-line line)))
#+end_src

