dist/aoc2024.html
<div id="outline-container-day-3" class="outline-2">
<h2 id="day-3">Day 3</h2>
<div class="outline-text-2" id="text-day-3">
</div>
<div id="outline-container-easy-sane-version" class="outline-3">
<h3 id="easy-sane-version">Easy, sane version</h3>
<div class="outline-text-3" id="text-easy-sane-version">
<p>
<a id="orga428baa"></a>
</p>

<p>
Just use <code>grep</code> to pre-process the file, or an available regex library.
</p>

<ul class="org-ul">
<li>3.1: <code>grep "mul([0-9][0-9]*,[0-9][0-9]*)" input &gt; preprocessed-1</code></li>
<li>3.2:
<code>grep -e "mul([0-9][0-9]*,[0-9][0-9]*) -e "do()" -e "don't()" input &gt; preprocessed-2</code></li>
</ul>

<p>
Then do the parsing and calculations in CL:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span class="org-keyword">defun</span> <span class="org-function-name">get-valid-muls</span> (mixed <span class="org-type">&amp;optional</span> (valid-region t))
  (<span class="org-keyword">let</span> ((valid '()) (valid-region valid-region))
    (<span class="org-keyword">loop</span> for string in mixed do
        (<span class="org-keyword">cond</span>
          ((string= string <span class="org-string">"do()"</span>) (setq valid-region t))
          ((string= string <span class="org-string">"don't()"</span>) (setq valid-region nil))
          (valid-region (setq valid (append valid (list string))))))
    (values valid valid-region)))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-mul</span> (mul-string)
  (<span class="org-keyword">let*</span> ((comma (position <span class="org-string">","</span> mul-string <span class="org-builtin">:test</span> #'string=))
           (left (parse-integer (subseq mul-string 4 comma)))
           (right (parse-integer
                   (subseq mul-string (1+ comma) (position <span class="org-string">")"</span> mul-string <span class="org-builtin">:test</span> #'string=)))))
    (* left right)))

(<span class="org-keyword">defun</span> <span class="org-function-name">mul-and-add-line</span> (mul-line)
  (reduce #'+ (mapcar #'parse-mul mul-line)))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-mul</span> (mul-string)
  (<span class="org-keyword">let*</span> ((comma (position <span class="org-string">","</span> mul-string <span class="org-builtin">:test</span> #'string=))
           (left (parse-integer (subseq mul-string 4 comma)))
           (right (parse-integer (subseq mul-string (1+ comma) (position <span class="org-string">")"</span> mul-string <span class="org-builtin">:test</span> #'string=)))))
    (* left right)))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1-preprocessed</span> (file)
  (<span class="org-keyword">let*</span> ((line (uiop:read-file-lines file)))
    (mul-and-add-line line)))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2-preprocessed</span> (file)
  (<span class="org-keyword">let</span> ((line (get-valid-muls (uiop:read-file-lines file))))
    (mul-and-add-line line)))
</pre>
</div>
</div>
</div>
