src/aoc2024.org
*** The hard way
:PROPERTIES:
:CUSTOM_ID: the-hard-way
:END:
So, actually I didn't want to install a regex library, so I implemented
my wonky regex engine by hard-coding the needed DFAs. The following is
an example of how an automaton is defined:

#+begin_src lisp
  (defstruct automaton (init nil) (end nil) (delta '()))

  (defparameter *delta*
		'((0 - "m" -> 1)
		  (1 - "u" -> 2)
		  (2 - "l" -> 3)
		  (3 - "(" -> 4)
		  (4 - number -> 5)
		  (5 - number -> 5)
		  (5 - "," -> 6)
		  (6 - number -> 7)
		  (7 - number -> 7)
		  (7 - ")" -> 8)))
#+end_src

Where the numbers represent states, the arrow is labeled with the symbol
that enables the transition, and =number= represents the =[0-9]= set of
chars. The actual matching on automata is handled in the following way
(some things can easily be optimized e.g. with hash maps):

#+begin_src lisp
  (defun rule-with-input (rules input)
    "returns the single rule that have input on the arrow"
    (let ((rule-list (remove-if-not #'(lambda (rule) (string= (third rule) input)) rules)))
      (if rule-list (first rule-list) nil)))

  (defun rule-with-number (rules)
    "returns the single rule that have -number->"
    (let ((rule-list (remove-if-not #'(lambda (rule) (eql (third rule) 'number)) rules)))
      (if rule-list (first rule-list) nil)))

  (defun rules-with-state (rules state)
    "returns list of rules for state"
    (remove-if-not #'(lambda (rule) (eql (first rule) state)) rules))

  (defun target-state (rule)
    (fifth rule))


  (defun apply-delta-char (delta state input)
    "Apply delta on a single char string."
    (let ((to-apply (rule-with-input (rules-with-state delta state) input)))
      (cond
       ((equal delta nil) nil)
       (to-apply
	(target-state to-apply))
       ((and (position input "0123456789" :test #'string=) (rule-with-number (rules-with-state delta state)))
	(target-state (rule-with-number (rules-with-state delta state))))
       (t nil))))

  (defun apply-delta-string (delta state input end-state)
    (apply-delta-string-aux delta state (concatenate 'string input (princ-to-string (code-char 1))) end-state 0))

  (defun apply-delta-string-aux (delta state input end-state position)
    "Apply delta on a string"
    (cond ((equal state end-state) (list t position))
	  ((equal state nil) (list nil (if (> position 1) (1- position) position)))
	  (t (apply-delta-string-aux delta (apply-delta-char delta state (subseq input 0 1)) (subseq input 1) end-state (1+ position)))))


  (defun check-multiple-automaton (automaton-list input)
    (let ((max 0))
      (loop for automaton in automaton-list do
	    (let ((possible-match
		   (apply-delta-string
		    (automaton-delta automaton)
		    (automaton-init automaton)
		    input
		    (automaton-end automaton))))
	      (cond
	       ((first possible-match) (return-from check-multiple-automaton possible-match))
	       (t (if (> (second possible-match) max) (setq max (second possible-match)))))
	      ))
      (list nil max)))

  (defun apply-on-automaton-list (automaton-list input)
    "Run the automaton on the input string and return the list of matches"
    (let ((i 0) (matches '()))
      (loop while (< i (length input))
	    do
	    (destructuring-bind
	     (result char-read)
	     (check-multiple-automaton automaton-list (subseq input i))
	     (cond
	      (result
	       (setq matches (append matches (list (subseq input i (+ i char-read)))))
	       (incf i char-read))
	      (t (incf i char-read)))))
      matches))
#+end_src

With =apply-on-automaton-list= it's possible to use multiple automata
for the matching. The solution is completed as following:

#+begin_src lisp
  (defparameter *mul-automaton* (make-automaton :init 0 :end 8 :delta
						'((0 - "m" -> 1)
						  (1 - "u" -> 2)
						  (2 - "l" -> 3)
						  (3 - "(" -> 4)
						  (4 - number -> 5)
						  (5 - number -> 5)
						  (5 - "," -> 6)
						  (6 - number -> 7)
						  (7 - number -> 7)
						  (7 - ")" -> 8))))

  (defparameter *do-automaton* (make-automaton :init 0 :end 4 :delta
					       '((0 - "d" -> 1)
						 (1 - "o" -> 2)
						 (2 -> "(" -> 3)
						 (3 -> ")" -> 4))))

  (defparameter *dont-automaton* (make-automaton :init 0 :end 7 :delta
						 '((0 - "d" -> 1)
						   (1 - "o" -> 2)
						   (2 - "n" -> 3)
						   (3 - "'" -> 4)
						   (4 - "t" -> 5)
						   (5 - "(" -> 6)
						   (6 - ")" -> 7))))


  (defun solve-1 (file)
    (let* ((lines (uiop:read-file-lines file))
	   (parsed-lines (mapcar #'(lambda (line) (apply-on-automaton *mul-automaton* line)) lines)))
      (reduce #'+ (mapcar #'mul-and-add-line parsed-lines))
      ))

  (defun solve-2 (file)
    (let* ((lines (uiop:read-file-lines file))
	   (valid-region t)
	   (valid-muls '()))
      (loop for line in lines do
	    (multiple-value-bind (valid last-valid-region)
				 (get-valid-muls
				  (apply-on-automaton-list (list *mul-automaton* *do-automaton* *dont-automaton*) line) valid-region)
				 (push valid valid-muls)
				 (setq valid-region last-valid-region)))
      (reduce #'+ (mapcar #'mul-and-add-line valid-muls))))
#+end_src

It would be really nice to automatically compile at least a subset of
the regex syntax into the equivalent automaton, but this is left as an
exercise /for future me, maybe/.

