dist/aoc2024.html
<div id="outline-container-the-hard-way" class="outline-3">
<h3 id="the-hard-way">The hard way</h3>
<div class="outline-text-3" id="text-the-hard-way">
<p>
So, actually I didn't want to install a regex library, so I implemented
my wonky regex engine by hard-coding the needed DFAs. The following is
an example of how an automaton is defined:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defstruct</span> <span class="org-type">automaton</span> (init nil) (end nil) (delta '()))

(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*delta*</span>
                '((0 - <span class="org-string">"m"</span> -&gt; 1)
                  (1 - <span class="org-string">"u"</span> -&gt; 2)
                  (2 - <span class="org-string">"l"</span> -&gt; 3)
                  (3 - <span class="org-string">"("</span> -&gt; 4)
                  (4 - number -&gt; 5)
                  (5 - number -&gt; 5)
                  (5 - <span class="org-string">","</span> -&gt; 6)
                  (6 - number -&gt; 7)
                  (7 - number -&gt; 7)
                  (7 - <span class="org-string">")"</span> -&gt; 8)))
</pre>
</div>

<p>
Where the numbers represent states, the arrow is labeled with the symbol
that enables the transition, and <code>number</code> represents the <code>[0-9]</code> set of
chars. The actual matching on automata is handled in the following way
(some things can easily be optimized e.g. with hash maps):
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">rule-with-input</span> (rules input)
  <span class="org-doc">"returns the single rule that have input on the arrow"</span>
  (<span class="org-keyword">let</span> ((rule-list (remove-if-not #'(<span class="org-keyword">lambda</span> (rule) (string= (third rule) input)) rules)))
    (<span class="org-keyword">if</span> rule-list (first rule-list) nil)))

(<span class="org-keyword">defun</span> <span class="org-function-name">rule-with-number</span> (rules)
  <span class="org-doc">"returns the single rule that have -number-&gt;"</span>
  (<span class="org-keyword">let</span> ((rule-list (remove-if-not #'(<span class="org-keyword">lambda</span> (rule) (eql (third rule) 'number)) rules)))
    (<span class="org-keyword">if</span> rule-list (first rule-list) nil)))

(<span class="org-keyword">defun</span> <span class="org-function-name">rules-with-state</span> (rules state)
  <span class="org-doc">"returns list of rules for state"</span>
  (remove-if-not #'(<span class="org-keyword">lambda</span> (rule) (eql (first rule) state)) rules))

(<span class="org-keyword">defun</span> <span class="org-function-name">target-state</span> (rule)
  (fifth rule))


(<span class="org-keyword">defun</span> <span class="org-function-name">apply-delta-char</span> (delta state input)
  <span class="org-doc">"Apply delta on a single char string."</span>
  (<span class="org-keyword">let</span> ((to-apply (rule-with-input (rules-with-state delta state) input)))
    (<span class="org-keyword">cond</span>
     ((equal delta nil) nil)
     (to-apply
        (target-state to-apply))
     ((and (position input <span class="org-string">"0123456789"</span> <span class="org-builtin">:test</span> #'string=) (rule-with-number (rules-with-state delta state)))
        (target-state (rule-with-number (rules-with-state delta state))))
     (t nil))))

(<span class="org-keyword">defun</span> <span class="org-function-name">apply-delta-string</span> (delta state input end-state)
  (apply-delta-string-aux delta state (concatenate 'string input (princ-to-string (code-char 1))) end-state 0))

(<span class="org-keyword">defun</span> <span class="org-function-name">apply-delta-string-aux</span> (delta state input end-state position)
  <span class="org-doc">"Apply delta on a string"</span>
  (<span class="org-keyword">cond</span> ((equal state end-state) (list t position))
          ((equal state nil) (list nil (<span class="org-keyword">if</span> (&gt; position 1) (1- position) position)))
          (t (apply-delta-string-aux delta (apply-delta-char delta state (subseq input 0 1)) (subseq input 1) end-state (1+ position)))))


(<span class="org-keyword">defun</span> <span class="org-function-name">check-multiple-automaton</span> (automaton-list input)
  (<span class="org-keyword">let</span> ((max 0))
    (<span class="org-keyword">loop</span> for automaton in automaton-list do
            (<span class="org-keyword">let</span> ((possible-match
                   (apply-delta-string
                    (automaton-delta automaton)
                    (automaton-init automaton)
                    input
                    (automaton-end automaton))))
              (<span class="org-keyword">cond</span>
               ((first possible-match) (<span class="org-keyword">return-from</span> check-multiple-automaton possible-match))
               (t (<span class="org-keyword">if</span> (&gt; (second possible-match) max) (setq max (second possible-match)))))
              ))
    (list nil max)))

(<span class="org-keyword">defun</span> <span class="org-function-name">apply-on-automaton-list</span> (automaton-list input)
  <span class="org-doc">"Run the automaton on the input string and return the list of matches"</span>
  (<span class="org-keyword">let</span> ((i 0) (matches '()))
    (<span class="org-keyword">loop</span> while (&lt; i (length input))
            do
            (<span class="org-keyword">destructuring-bind</span>
             (result char-read)
             (check-multiple-automaton automaton-list (subseq input i))
             (<span class="org-keyword">cond</span>
              (result
               (setq matches (append matches (list (subseq input i (+ i char-read)))))
               (incf i char-read))
              (t (incf i char-read)))))
    matches))
</pre>
</div>

<p>
With <code>apply-on-automaton-list</code> it's possible to use multiple automata
for the matching. The solution is completed as following:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*mul-automaton*</span> (make-automaton <span class="org-builtin">:init</span> 0 <span class="org-builtin">:end</span> 8 <span class="org-builtin">:delta</span>
                                                '((0 - <span class="org-string">"m"</span> -&gt; 1)
                                                  (1 - <span class="org-string">"u"</span> -&gt; 2)
                                                  (2 - <span class="org-string">"l"</span> -&gt; 3)
                                                  (3 - <span class="org-string">"("</span> -&gt; 4)
                                                  (4 - number -&gt; 5)
                                                  (5 - number -&gt; 5)
                                                  (5 - <span class="org-string">","</span> -&gt; 6)
                                                  (6 - number -&gt; 7)
                                                  (7 - number -&gt; 7)
                                                  (7 - <span class="org-string">")"</span> -&gt; 8))))

(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*do-automaton*</span> (make-automaton <span class="org-builtin">:init</span> 0 <span class="org-builtin">:end</span> 4 <span class="org-builtin">:delta</span>
                                               '((0 - <span class="org-string">"d"</span> -&gt; 1)
                                                 (1 - <span class="org-string">"o"</span> -&gt; 2)
                                                 (2 -&gt; <span class="org-string">"("</span> -&gt; 3)
                                                 (3 -&gt; <span class="org-string">")"</span> -&gt; 4))))

(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*dont-automaton*</span> (make-automaton <span class="org-builtin">:init</span> 0 <span class="org-builtin">:end</span> 7 <span class="org-builtin">:delta</span>
                                                 '((0 - <span class="org-string">"d"</span> -&gt; 1)
                                                   (1 - <span class="org-string">"o"</span> -&gt; 2)
                                                   (2 - <span class="org-string">"n"</span> -&gt; 3)
                                                   (3 - <span class="org-string">"'"</span> -&gt; 4)
                                                   (4 - <span class="org-string">"t"</span> -&gt; 5)
                                                   (5 - <span class="org-string">"("</span> -&gt; 6)
                                                   (6 - <span class="org-string">")"</span> -&gt; 7))))


(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (parsed-lines (mapcar #'(<span class="org-keyword">lambda</span> (line) (apply-on-automaton *mul-automaton* line)) lines)))
    (reduce #'+ (mapcar #'mul-and-add-line parsed-lines))
    ))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (valid-region t)
           (valid-muls '()))
    (<span class="org-keyword">loop</span> for line in lines do
            (<span class="org-keyword">multiple-value-bind</span> (valid last-valid-region)
                                 (get-valid-muls
                                  (apply-on-automaton-list (list *mul-automaton* *do-automaton* *dont-automaton*) line) valid-region)
                                 (push valid valid-muls)
                                 (setq valid-region last-valid-region)))
    (reduce #'+ (mapcar #'mul-and-add-line valid-muls))))
</pre>
</div>

<p>
It would be really nice to automatically compile at least a subset of
the regex syntax into the equivalent automaton, but this is left as an
exercise <i>for future me, maybe</i>.
</p>
</div>
</div>
</div>
