src/aoc2024.org
** Day 4
:PROPERTIES:
:CUSTOM_ID: day-4
:END:
#+begin_src lisp

  (load "../utils.lisp")

  (defun get-diagonals (lines &optional (len 4))
    "From bottom right to top left"
    (loop for i from (1- len) below (length lines)
	  collect
	  (loop for j from (1- len) below (length (nth i lines))
		collect
		(utils:string-join ""
				   (loop for k from 0 to (1- len)
					 collect (subseq (nth (- i k) lines) (- j k) (1+ (- j k))))))))

  (defun get-squares (lines &optional (dim 3))
    (loop for i from 0 to (- (length lines) dim)
	  nconc
	  (loop for j from 0 to (- (length (nth i lines)) dim)
		collect
		(utils:string-join (list #\Newline)
				   (loop for k from 0 below dim collect (subseq (nth (+ k i) lines) j (+ j dim)))))))


  (defun get-anti-diagonals (lines &optional (len 4))
    "From bottom left to top right."
    (loop for i from (1- len) below (length lines) collect
	  (loop for j from 0 below (- (length (nth i lines)) (1- len))
		collect
		(utils:string-join ""
				   (loop for k from 0 to (1- len)
					 collect (subseq (nth (- i k) lines) (+ j k) (1+ (+ j k))))))))


  (defun get-vertical (lines)
    (let ((vertical '()))
      (loop for line in lines do
	    (loop for i from 0 below (length line) do
		  (cond
		   ((nth i vertical) (setf (nth i vertical) (concatenate 'string (nth i vertical) (subseq line i (1+ i)))))
		   (t (setf vertical (append vertical (list (subseq line i (1+ i)))))))))
      vertical))


  (defun count-horizontal (lines word)
    (+
     (reduce #'+
	     (mapcar #'(lambda (line) (count word (utils:regex-match-all word line) :test #'string=)) lines))
     (reduce #'+
	     (mapcar #'(lambda (line) (count (reverse word) (utils:regex-match-all (reverse word) line) :test #'string=)) lines))))

  (defun count-main-diagonals (lines word)
    (+
     (reduce #'+
	     (mapcar #'(lambda (line) (count word line :test #'string=)) (get-diagonals lines (length word))))
     (reduce #'+
	     (mapcar #'(lambda (line) (count (reverse word) line :test #'string=)) (get-diagonals lines (length word))))))

  (defun count-anti-diagonals (lines word)
    (+
     (reduce #'+
	     (mapcar #'(lambda (line) (count word line :test #'string=)) (get-anti-diagonals lines (length word))))
     (reduce #'+
	     (mapcar #'(lambda (line) (count (reverse word) line :test #'string=)) (get-anti-diagonals lines (length word))))))

  (defun count-vertical (lines word)
    (+
     (reduce #'+
	     (mapcar #'(lambda (line) (count word (utils:regex-match-all word line) :test #'string=)) (get-vertical lines)))
     (reduce #'+
	     (mapcar #'(lambda (line) (count (reverse word) (utils:regex-match-all (reverse word) line) :test #'string=)) (get-vertical lines)))))

  (defun solve-1 (file)
    (let ((lines (uiop:read-file-lines file)))
      (+
       ;; horizontal
       (count-horizontal lines "XMAS")
       ;; main diagonals
       (count-main-diagonals lines "XMAS")
       ;; anti-diagonals
       (count-anti-diagonals lines "XMAS")
       ;; vertical
       (count-vertical lines "XMAS")
       )))

  (defun solve-2 (file)
    (let ((lines (uiop:read-file-lines file)) (total 0))
      (loop for square in (get-squares lines (length "MAS"))
	    do
	    (let* ((square-lines (uiop:split-string square :separator '(#\Newline)))
		   (partial (+ (count-main-diagonals square-lines "MAS")
			       (count-anti-diagonals square-lines "MAS"))))
	      (if (= 2 partial) (incf total)))) ;; count one only if both diagonals match
      total))
#+end_src

