dist/aoc2024.html
<div id="outline-container-day-4" class="outline-2">
<h2 id="day-4">Day 4</h2>
<div class="outline-text-2" id="text-day-4">
<div class="org-src-container">
<pre class="src src-lisp">
(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">get-diagonals</span> (lines <span class="org-type">&amp;optional</span> (len 4))
  <span class="org-doc">"From bottom right to top left"</span>
  (<span class="org-keyword">loop</span> for i from (1- len) below (length lines)
          collect
          (<span class="org-keyword">loop</span> for j from (1- len) below (length (nth i lines))
                collect
                (utils:string-join <span class="org-string">""</span>
                                   (<span class="org-keyword">loop</span> for k from 0 to (1- len)
                                         collect (subseq (nth (- i k) lines) (- j k) (1+ (- j k))))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">get-squares</span> (lines <span class="org-type">&amp;optional</span> (dim 3))
  (<span class="org-keyword">loop</span> for i from 0 to (- (length lines) dim)
          nconc
          (<span class="org-keyword">loop</span> for j from 0 to (- (length (nth i lines)) dim)
                collect
                (utils:string-join (list #\Newline)
                                   (<span class="org-keyword">loop</span> for k from 0 below dim collect (subseq (nth (+ k i) lines) j (+ j dim)))))))


(<span class="org-keyword">defun</span> <span class="org-function-name">get-anti-diagonals</span> (lines <span class="org-type">&amp;optional</span> (len 4))
  <span class="org-doc">"From bottom left to top right."</span>
  (<span class="org-keyword">loop</span> for i from (1- len) below (length lines) collect
          (<span class="org-keyword">loop</span> for j from 0 below (- (length (nth i lines)) (1- len))
                collect
                (utils:string-join <span class="org-string">""</span>
                                   (<span class="org-keyword">loop</span> for k from 0 to (1- len)
                                         collect (subseq (nth (- i k) lines) (+ j k) (1+ (+ j k))))))))


(<span class="org-keyword">defun</span> <span class="org-function-name">get-vertical</span> (lines)
  (<span class="org-keyword">let</span> ((vertical '()))
    (<span class="org-keyword">loop</span> for line in lines do
            (<span class="org-keyword">loop</span> for i from 0 below (length line) do
                  (<span class="org-keyword">cond</span>
                   ((nth i vertical) (setf (nth i vertical) (concatenate 'string (nth i vertical) (subseq line i (1+ i)))))
                   (t (setf vertical (append vertical (list (subseq line i (1+ i)))))))))
    vertical))


(<span class="org-keyword">defun</span> <span class="org-function-name">count-horizontal</span> (lines word)
  (+
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count word (utils:regex-match-all word line) <span class="org-builtin">:test</span> #'string=)) lines))
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count (reverse word) (utils:regex-match-all (reverse word) line) <span class="org-builtin">:test</span> #'string=)) lines))))

(<span class="org-keyword">defun</span> <span class="org-function-name">count-main-diagonals</span> (lines word)
  (+
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count word line <span class="org-builtin">:test</span> #'string=)) (get-diagonals lines (length word))))
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count (reverse word) line <span class="org-builtin">:test</span> #'string=)) (get-diagonals lines (length word))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">count-anti-diagonals</span> (lines word)
  (+
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count word line <span class="org-builtin">:test</span> #'string=)) (get-anti-diagonals lines (length word))))
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count (reverse word) line <span class="org-builtin">:test</span> #'string=)) (get-anti-diagonals lines (length word))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">count-vertical</span> (lines word)
  (+
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count word (utils:regex-match-all word line) <span class="org-builtin">:test</span> #'string=)) (get-vertical lines)))
   (reduce #'+
             (mapcar #'(<span class="org-keyword">lambda</span> (line) (count (reverse word) (utils:regex-match-all (reverse word) line) <span class="org-builtin">:test</span> #'string=)) (get-vertical lines)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">let</span> ((lines (uiop:read-file-lines file)))
    (+
     <span class="org-comment-delimiter">;; </span><span class="org-comment">horizontal</span>
     (count-horizontal lines <span class="org-string">"XMAS"</span>)
     <span class="org-comment-delimiter">;; </span><span class="org-comment">main diagonals</span>
     (count-main-diagonals lines <span class="org-string">"XMAS"</span>)
     <span class="org-comment-delimiter">;; </span><span class="org-comment">anti-diagonals</span>
     (count-anti-diagonals lines <span class="org-string">"XMAS"</span>)
     <span class="org-comment-delimiter">;; </span><span class="org-comment">vertical</span>
     (count-vertical lines <span class="org-string">"XMAS"</span>)
     )))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">let</span> ((lines (uiop:read-file-lines file)) (total 0))
    (<span class="org-keyword">loop</span> for square in (get-squares lines (length <span class="org-string">"MAS"</span>))
            do
            (<span class="org-keyword">let*</span> ((square-lines (uiop:split-string square <span class="org-builtin">:separator</span> '(#\Newline)))
                   (partial (+ (count-main-diagonals square-lines <span class="org-string">"MAS"</span>)
                               (count-anti-diagonals square-lines <span class="org-string">"MAS"</span>))))
              (<span class="org-keyword">if</span> (= 2 partial) (incf total)))) <span class="org-comment-delimiter">;; </span><span class="org-comment">count one only if both diagonals match</span>
    total))
</pre>
</div>
</div>
</div>
