src/aoc2024.org
** Day 5
:PROPERTIES:
:CUSTOM_ID: day-5
:END:
At start I tried to do something fancy by computing the topological
order of the nodes in the dependency graph created with the ordering
rules, but it ended up not working so I reverted to the simplest
solution I could think of.

#+begin_src lisp
  (defun parse-sequence (sequence)
    (mapcar #'parse-integer (uiop:split-string sequence :separator '(#\,))))


  (defun check-ordering (rules sequence)
    (loop for i from 1 below (length sequence)
	  do (if (some #'(lambda (elem) (find elem (gethash (nth i sequence) rules))) (subseq sequence 0 i))
		 (return-from check-ordering nil)))
    t)

  (defun parse-ordering-rules (rules)
    (let ((parsed (make-hash-table)))
      (loop for rule in rules
	    do (let* ((pipe-pos (position "|" rule :test #'string=))
		      (left (parse-integer (subseq rule 0 pipe-pos)))
		      (right (parse-integer (subseq rule (1+ pipe-pos)))))
		 (push right (gethash left parsed))))
      parsed))

  (defun preprocess-file (file)
    (let* ((lines (uiop:read-file-lines file))
	   (empty-line-pos (position "" lines :test #'string=)))
      (list (subseq lines 0 empty-line-pos) (subseq lines (1+ empty-line-pos)))))

  (defun compare (x y rules)
    "Returns non-NIL if x comes before y according to the rules."
    (find y (gethash x rules)))

  (defun middle-element (sequence)
    (nth (floor (/ (length sequence) 2)) sequence))

  (defun solve-1 (file)
    (destructuring-bind (raw-rules raw-sequences) (preprocess-file file)
			(let ((rules (parse-ordering-rules raw-rules))
			      (sequences (mapcar #'parse-sequence raw-sequences)))
			  (reduce #'+ (mapcar #'middle-element
					      (remove-if-not #'(lambda (sequence) (check-ordering rules sequence)) sequences))))))

  (defun solve-2 (file)
    (destructuring-bind (raw-rules raw-sequences) (preprocess-file file)
			(let* ((rules (parse-ordering-rules raw-rules))
			       (sequences (mapcar #'parse-sequence raw-sequences))
			       (not-ordered (remove-if #'(lambda (sequence) (check-ordering rules sequence)) sequences)))
			  (reduce #'+ (mapcar
				       #'middle-element
				       (mapcar
					#'(lambda (sequence)
					    (sort sequence #'(lambda (x y) (compare x y rules))))
					not-ordered))))))
#+end_src

