dist/aoc2024.html
<div id="outline-container-day-5" class="outline-2">
<h2 id="day-5">Day 5</h2>
<div class="outline-text-2" id="text-day-5">
<p>
At start I tried to do something fancy by computing the topological
order of the nodes in the dependency graph created with the ordering
rules, but it ended up not working so I reverted to the simplest
solution I could think of.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">parse-sequence</span> (sequence)
  (mapcar #'parse-integer (uiop:split-string sequence <span class="org-builtin">:separator</span> '(#\,))))


(<span class="org-keyword">defun</span> <span class="org-function-name">check-ordering</span> (rules sequence)
  (<span class="org-keyword">loop</span> for i from 1 below (length sequence)
          do (<span class="org-keyword">if</span> (some #'(<span class="org-keyword">lambda</span> (elem) (find elem (gethash (nth i sequence) rules))) (subseq sequence 0 i))
                 (<span class="org-keyword">return-from</span> check-ordering nil)))
  t)

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-ordering-rules</span> (rules)
  (<span class="org-keyword">let</span> ((parsed (make-hash-table)))
    (<span class="org-keyword">loop</span> for rule in rules
            do (<span class="org-keyword">let*</span> ((pipe-pos (position <span class="org-string">"|"</span> rule <span class="org-builtin">:test</span> #'string=))
                      (left (parse-integer (subseq rule 0 pipe-pos)))
                      (right (parse-integer (subseq rule (1+ pipe-pos)))))
                 (push right (gethash left parsed))))
    parsed))

(<span class="org-keyword">defun</span> <span class="org-function-name">preprocess-file</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (empty-line-pos (position <span class="org-string">""</span> lines <span class="org-builtin">:test</span> #'string=)))
    (list (subseq lines 0 empty-line-pos) (subseq lines (1+ empty-line-pos)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">compare</span> (x y rules)
  <span class="org-doc">"Returns non-NIL if x comes before y according to the rules."</span>
  (find y (gethash x rules)))

(<span class="org-keyword">defun</span> <span class="org-function-name">middle-element</span> (sequence)
  (nth (floor (/ (length sequence) 2)) sequence))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">destructuring-bind</span> (raw-rules raw-sequences) (preprocess-file file)
                        (<span class="org-keyword">let</span> ((rules (parse-ordering-rules raw-rules))
                              (sequences (mapcar #'parse-sequence raw-sequences)))
                          (reduce #'+ (mapcar #'middle-element
                                              (remove-if-not #'(<span class="org-keyword">lambda</span> (sequence) (check-ordering rules sequence)) sequences))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">destructuring-bind</span> (raw-rules raw-sequences) (preprocess-file file)
                        (<span class="org-keyword">let*</span> ((rules (parse-ordering-rules raw-rules))
                               (sequences (mapcar #'parse-sequence raw-sequences))
                               (not-ordered (remove-if #'(<span class="org-keyword">lambda</span> (sequence) (check-ordering rules sequence)) sequences)))
                          (reduce #'+ (mapcar
                                       #'middle-element
                                       (mapcar
                                        #'(<span class="org-keyword">lambda</span> (sequence)
                                            (sort sequence #'(<span class="org-keyword">lambda</span> (x y) (compare x y rules))))
                                        not-ordered))))))
</pre>
</div>
</div>
</div>
