src/aoc2024.org
** Day 6
:PROPERTIES:
:CUSTOM_ID: day-6
:END:
This solution is not only inefficient, but also /wonky/ in my opinion.
But hey! Still learning the language, so everything is accepted right?
*Right?*

#+begin_src lisp
  (defparameter *test*
		(uiop:split-string
		 "....#.....
  .........#
  ..........
  ..#.......
  .......#..
  ..........
  .#..^.....
  ........#.
  #.........
  ......#..." :separator '(#\Newline)))


  ;; position can be 'up 'down 'left 'right
  (defstruct game-map (grid nil) (guard-position nil) (guard-facing nil))

  (defun parse-grid (rows) ;; assumed to be list of strings
    (let* ((nrows (length rows))
	   (ncols (length (first rows)))
	   (grid (make-array (list nrows ncols)))
	   (guard-position '(0 0))
	   (facing 'up))
      (loop for i from 0 below nrows
	    do (loop for j from 0 below ncols
		     do (let ((current-char (schar (nth i rows) j)))
			  (setf (aref grid i j) current-char)
			  (cond
			   ((char= current-char #\^) (setf facing 'up) (setf guard-position (list i j)))
			   ((char= current-char #\v) (setf facing 'down) (setf guard-position (list i j)))
			   ((char= current-char #\>) (setf facing 'right) (setf guard-position (list i j)))
			   ((char= current-char #\<) (setf facing 'left) (setf guard-position (list i j)))
			   (t t)))))
      (make-game-map :grid grid :guard-position guard-position :guard-facing facing)))


  (defun take-step (map current-position facing &optional (added-obstacle-position nil added-obstacle-p))
    (let* ((nrows (array-dimension (game-map-grid map) 0))
	   (ncols (array-dimension (game-map-grid map) 1))
	   (next-row 0)
	   (next-col 0))
      (cond
       ((eq facing 'up)
	(setf next-row (1- (first current-position)))
	(setf next-col (second current-position)))
       ((eq facing 'down)
	(setf next-row (1+ (first current-position)))
	(setf next-col (second current-position)))
       ((eq facing 'left)
	(setf next-row (first current-position))
	(setf next-col (1- (second current-position))))
       ((eq facing 'right)
	(setf next-row (first current-position))
	(setf next-col (1+ (second current-position)))))

      (when (or (>= next-row nrows) (< next-row 0) (>= next-col ncols) (< next-col 0))
	(return-from take-step nil))

      (if (or (and added-obstacle-p (equal added-obstacle-position (list next-row next-col)))
	      (char= #\# (aref (game-map-grid map) next-row next-col)))
	  (cond
	   ((eq facing 'down)
	    (list 'left (list (1- next-row) (1- next-col))))
	   ((eq facing 'up)
	    (list 'right (list (1+ next-row) (1+ next-col))))
	   ((eq facing 'left)
	    (list 'up (list (1- next-row) (1+ next-col))))
	   ((eq facing 'right)
	    (list 'down (list (1+ next-row) (1- next-col)))))
	(list facing (list next-row next-col)))
      ))


  (defun solve-1 (file)
    (let* ((map (parse-grid (uiop:read-file-lines file)))
	   (position (copy-list (game-map-guard-position map)))
	   (facing (game-map-guard-facing map))
	   (counter 0)
	   (visited (make-array (array-dimensions (game-map-grid map)) :initial-element nil)))
      (loop while position 
	    do (unless (aref visited (first position) (second position)) (incf counter))
	    (setf (aref visited (first position) (second position)) t)
	    (let ((result (take-step map position facing)))
	      (if result
		  (destructuring-bind (new-facing new-position) result
				      (setf position new-position)
				      (setf facing new-facing))
		(setf position nil))))
      counter))

  (defun solve-2 (file)
    (let* ((map (parse-grid (uiop:read-file-lines file)))
	   (position (copy-list (game-map-guard-position map)))
	   (facing (game-map-guard-facing map))
	   (obstacles 0)
	   (nrows (array-dimension (game-map-grid map) 0))
	   (ncols (array-dimension (game-map-grid map) 1))
	   (loop-detected nil)
	   (visited-facing (make-array (list nrows ncols) :initial-element nil)))
      (loop for i from 0 below nrows
	    do (loop for j from 0 below ncols
		     do (loop initially (setf position (copy-list (game-map-guard-position map)))
			      (setf facing (game-map-guard-facing map))
			      (setf loop-detected nil)
			      (setf visited-facing (make-array (list nrows ncols) :initial-element nil))
			      while (and position (not loop-detected))
			      do (let ((result (take-step map position facing (list i j))))
				   (if result
				       (destructuring-bind (new-facing new-position) result
							   (when (and (aref visited-facing (first new-position) (second new-position))
								      (equal new-facing (aref visited-facing (first new-position) (second new-position))))
							     (setf loop-detected t))
							   (setf (aref visited-facing (first position) (second position)) facing)
							   (setf position new-position)
							   (setf facing new-facing))
				     (setf position nil)))
			      finally (when loop-detected
					(incf obstacles)))))
      obstacles))
#+end_src

