dist/aoc2024.html
<div id="outline-container-day-6" class="outline-2">
<h2 id="day-6">Day 6</h2>
<div class="outline-text-2" id="text-day-6">
<p>
This solution is not only inefficient, but also <i>wonky</i> in my opinion.
But hey! Still learning the language, so everything is accepted right?
<b>Right?</b>
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*test*</span>
                (uiop:split-string
                 <span class="org-string">"....#.....</span>
<span class="org-string">.........#</span>
<span class="org-string">..........</span>
<span class="org-string">..#.......</span>
<span class="org-string">.......#..</span>
<span class="org-string">..........</span>
<span class="org-string">.#..^.....</span>
<span class="org-string">........#.</span>
<span class="org-string">#.........</span>
<span class="org-string">......#..."</span> <span class="org-builtin">:separator</span> '(#\Newline)))


<span class="org-comment-delimiter">;; </span><span class="org-comment">position can be 'up 'down 'left 'right</span>
(<span class="org-keyword">defstruct</span> <span class="org-type">game-map</span> (grid nil) (guard-position nil) (guard-facing nil))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-grid</span> (rows) <span class="org-comment-delimiter">;; </span><span class="org-comment">assumed to be list of strings</span>
  (<span class="org-keyword">let*</span> ((nrows (length rows))
           (ncols (length (first rows)))
           (grid (make-array (list nrows ncols)))
           (guard-position '(0 0))
           (facing 'up))
    (<span class="org-keyword">loop</span> for i from 0 below nrows
            do (<span class="org-keyword">loop</span> for j from 0 below ncols
                     do (<span class="org-keyword">let</span> ((current-char (schar (nth i rows) j)))
                          (setf (aref grid i j) current-char)
                          (<span class="org-keyword">cond</span>
                           ((char= current-char #\^) (setf facing 'up) (setf guard-position (list i j)))
                           ((char= current-char #\v) (setf facing 'down) (setf guard-position (list i j)))
                           ((char= current-char #\&gt;) (setf facing 'right) (setf guard-position (list i j)))
                           ((char= current-char #\&lt;) (setf facing 'left) (setf guard-position (list i j)))
                           (t t)))))
    (make-game-map <span class="org-builtin">:grid</span> grid <span class="org-builtin">:guard-position</span> guard-position <span class="org-builtin">:guard-facing</span> facing)))


(<span class="org-keyword">defun</span> <span class="org-function-name">take-step</span> (map current-position facing <span class="org-type">&amp;optional</span> (added-obstacle-position nil added-obstacle-p))
  (<span class="org-keyword">let*</span> ((nrows (array-dimension (game-map-grid map) 0))
           (ncols (array-dimension (game-map-grid map) 1))
           (next-row 0)
           (next-col 0))
    (<span class="org-keyword">cond</span>
     ((eq facing 'up)
        (setf next-row (1- (first current-position)))
        (setf next-col (second current-position)))
     ((eq facing 'down)
        (setf next-row (1+ (first current-position)))
        (setf next-col (second current-position)))
     ((eq facing 'left)
        (setf next-row (first current-position))
        (setf next-col (1- (second current-position))))
     ((eq facing 'right)
        (setf next-row (first current-position))
        (setf next-col (1+ (second current-position)))))

    (<span class="org-keyword">when</span> (or (&gt;= next-row nrows) (&lt; next-row 0) (&gt;= next-col ncols) (&lt; next-col 0))
        (<span class="org-keyword">return-from</span> take-step nil))

    (<span class="org-keyword">if</span> (or (and added-obstacle-p (equal added-obstacle-position (list next-row next-col)))
              (char= #\# (aref (game-map-grid map) next-row next-col)))
          (<span class="org-keyword">cond</span>
           ((eq facing 'down)
            (list 'left (list (1- next-row) (1- next-col))))
           ((eq facing 'up)
            (list 'right (list (1+ next-row) (1+ next-col))))
           ((eq facing 'left)
            (list 'up (list (1- next-row) (1+ next-col))))
           ((eq facing 'right)
            (list 'down (list (1+ next-row) (1- next-col)))))
        (list facing (list next-row next-col)))
    ))


(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">let*</span> ((map (parse-grid (uiop:read-file-lines file)))
           (position (copy-list (game-map-guard-position map)))
           (facing (game-map-guard-facing map))
           (counter 0)
           (visited (make-array (array-dimensions (game-map-grid map)) <span class="org-builtin">:initial-element</span> nil)))
    (<span class="org-keyword">loop</span> while position 
            do (<span class="org-keyword">unless</span> (aref visited (first position) (second position)) (incf counter))
            (setf (aref visited (first position) (second position)) t)
            (<span class="org-keyword">let</span> ((result (take-step map position facing)))
              (<span class="org-keyword">if</span> result
                  (<span class="org-keyword">destructuring-bind</span> (new-facing new-position) result
                                      (setf position new-position)
                                      (setf facing new-facing))
                (setf position nil))))
    counter))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">let*</span> ((map (parse-grid (uiop:read-file-lines file)))
           (position (copy-list (game-map-guard-position map)))
           (facing (game-map-guard-facing map))
           (obstacles 0)
           (nrows (array-dimension (game-map-grid map) 0))
           (ncols (array-dimension (game-map-grid map) 1))
           (loop-detected nil)
           (visited-facing (make-array (list nrows ncols) <span class="org-builtin">:initial-element</span> nil)))
    (<span class="org-keyword">loop</span> for i from 0 below nrows
            do (<span class="org-keyword">loop</span> for j from 0 below ncols
                     do (<span class="org-keyword">loop</span> initially (setf position (copy-list (game-map-guard-position map)))
                              (setf facing (game-map-guard-facing map))
                              (setf loop-detected nil)
                              (setf visited-facing (make-array (list nrows ncols) <span class="org-builtin">:initial-element</span> nil))
                              while (and position (not loop-detected))
                              do (<span class="org-keyword">let</span> ((result (take-step map position facing (list i j))))
                                   (<span class="org-keyword">if</span> result
                                       (<span class="org-keyword">destructuring-bind</span> (new-facing new-position) result
                                                           (<span class="org-keyword">when</span> (and (aref visited-facing (first new-position) (second new-position))
                                                                      (equal new-facing (aref visited-facing (first new-position) (second new-position))))
                                                             (setf loop-detected t))
                                                           (setf (aref visited-facing (first position) (second position)) facing)
                                                           (setf position new-position)
                                                           (setf facing new-facing))
                                     (setf position nil)))
                              finally (<span class="org-keyword">when</span> loop-detected
                                        (incf obstacles)))))
    obstacles))
</pre>
</div>
</div>
</div>
