src/aoc2024.org
** Day 7
:PROPERTIES:
:CUSTOM_ID: day-7
:END:
Passing the possible operators as high-order functions and using a bit
of recursion magic, day 7 is pretty straightforward. The solution for
the second part is the same as the first, with the only difference that
the new =concatenate= operator is also considered. Abstraction FTW!

#+begin_src lisp
  (load "../utils.lisp")

  (defstruct equation (result nil) (terms nil))

  (defun possible-results (terms operators)
    (cond
     ((= 1 (length terms)) terms)
     (t (loop for operator in operators
	      nconc (let ((partial (funcall operator (first terms) (second terms))))
		      (possible-results (cons partial (cdr (cdr terms))) operators))))))

  (defun equation-valid-p (equation operators)
    (some #'(lambda (possible) (= possible (equation-result equation))) (possible-results (equation-terms equation) operators)))

  (defun parse-equation (line)
    (let* ((terms (utils:split-by-one-space line))
	   (colon-pos (position #\: (car terms) :test #'char=)))
      (make-equation :result (parse-integer (subseq (car terms) 0 colon-pos))
		     :terms (mapcar #'parse-integer (cdr terms)))))

  (defun concatenation (term1 term2)
    (parse-integer (concatenate 'string (princ-to-string term1) (princ-to-string term2))))

  (defun solve-1 (file)
    (let* ((lines (uiop:read-file-lines file))
	   (equations (mapcar #'parse-equation lines))
	   (valid-equations
	    (remove-if-not #'(lambda (equation) (equation-valid-p equation (list #'+ #'*))) equations)))
      (reduce #'+ (mapcar #'(lambda (equation) (equation-result equation)) valid-equations))))

  (defun solve-2 (file)
    (let* ((lines (uiop:read-file-lines file))
	   (equations (mapcar #'parse-equation lines))
	   (valid-equations
	    (remove-if-not #'(lambda (equation) (equation-valid-p equation (list #'+ #'* #'concatenation))) equations)))
      (reduce #'+ (mapcar #'(lambda (equation) (equation-result equation)) valid-equations))))
#+end_src

