dist/aoc2024.html
<div id="outline-container-day-7" class="outline-2">
<h2 id="day-7">Day 7</h2>
<div class="outline-text-2" id="text-day-7">
<p>
Passing the possible operators as high-order functions and using a bit
of recursion magic, day 7 is pretty straightforward. The solution for
the second part is the same as the first, with the only difference that
the new <code>concatenate</code> operator is also considered. Abstraction FTW!
</p>

<div class="org-src-container">
<pre class="src src-lisp">(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defstruct</span> <span class="org-type">equation</span> (result nil) (terms nil))

(<span class="org-keyword">defun</span> <span class="org-function-name">possible-results</span> (terms operators)
  (<span class="org-keyword">cond</span>
   ((= 1 (length terms)) terms)
   (t (<span class="org-keyword">loop</span> for operator in operators
              nconc (<span class="org-keyword">let</span> ((partial (funcall operator (first terms) (second terms))))
                      (possible-results (cons partial (cdr (cdr terms))) operators))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">equation-valid-p</span> (equation operators)
  (some #'(<span class="org-keyword">lambda</span> (possible) (= possible (equation-result equation))) (possible-results (equation-terms equation) operators)))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-equation</span> (line)
  (<span class="org-keyword">let*</span> ((terms (utils:split-by-one-space line))
           (colon-pos (position #\: (car terms) <span class="org-builtin">:test</span> #'char=)))
    (make-equation <span class="org-builtin">:result</span> (parse-integer (subseq (car terms) 0 colon-pos))
                     <span class="org-builtin">:terms</span> (mapcar #'parse-integer (cdr terms)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">concatenation</span> (term1 term2)
  (parse-integer (concatenate 'string (princ-to-string term1) (princ-to-string term2))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (equations (mapcar #'parse-equation lines))
           (valid-equations
            (remove-if-not #'(<span class="org-keyword">lambda</span> (equation) (equation-valid-p equation (list #'+ #'*))) equations)))
    (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (equation) (equation-result equation)) valid-equations))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (equations (mapcar #'parse-equation lines))
           (valid-equations
            (remove-if-not #'(<span class="org-keyword">lambda</span> (equation) (equation-valid-p equation (list #'+ #'* #'concatenation))) equations)))
    (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (equation) (equation-result equation)) valid-equations))))
</pre>
</div>
</div>
</div>
