src/aoc2024.org
** Day 8
:PROPERTIES:
:CUSTOM_ID: day-8
:END:
I tried to make =get-antinodes-positions= and =count-antinodes= as most
general as possible even if I know that just copy-pasting the functions
and making small edits would've solved the problem anyway.

#+begin_src lisp
  (load "../utils.lisp")

  (defstruct grid (antennas nil) (nrows nil) (ncols nil))

  (defun parse-grid (lines)
    (let ((frequencies (make-hash-table))
	  (nrows (length lines))
	  (ncols (length (first lines))))
      (loop for row from 0 below nrows
	    nconc (loop for col from 0 below ncols
			do (let ((current-char (char (nth row lines) col)))
			     (when (char-not-equal current-char #\.)
			       (push (list row col) (gethash current-char frequencies))))))
      (make-grid :antennas frequencies :nrows nrows :ncols ncols)))

  (defun get-antinodes-positions (antenna-1 antenna-2 &key (delta-x 1) (delta-y 1) (min-antinode-offset 1) (max-antinode-offset 1))
    (destructuring-bind (a1 a2)
			(if (utils:compare-lists antenna-1 antenna-2)
			    (list antenna-1 antenna-2)
			  (list antenna-2 antenna-1))
			(let* ((a1-x (second a1)) (a1-y (first a1))
			       (a2-x (second a2)) (a2-y (first a2))
			       (delta-x (if (functionp delta-x)
					    (funcall delta-x a1 a2)
					  delta-x))
			       (delta-y (if (functionp delta-y)
					    (funcall delta-y a1 a2)
					  delta-y)))
			  (loop for i from min-antinode-offset to max-antinode-offset
				for computed-delta-x = (* i delta-x)
				for computed-delta-y = (* i delta-y)
				if (<= a1-x a2-x)
				nconc (list (list (- a1-y computed-delta-y) (- a1-x computed-delta-x))
					    (list (+ a2-y computed-delta-y) (+ a2-x computed-delta-x)))
				else
				nconc (list (list (- a1-y computed-delta-y) (+ a1-x computed-delta-x))
					    (list (+ a2-y computed-delta-y) (- a2-x computed-delta-x)))))))

  (defun out-of-bounds-p (position nrows ncols)
    (let ((col (second position))
	  (row (first position)))
      (or (< col 0) (< row 0) (>= col ncols) (>= row nrows))))

  (defun counted-p (position counted)
    (aref counted (first position) (second position)))

  (defun set-counted (position counted)
    "Set the position as counted. Modifies counted (an array)."
    (setf (aref counted (first position) (second position)) t))


  (defun count-antinodes (antennas nrows ncols counted &key (delta-x 1) (delta-y 1) (min-antinode-offset 1) (max-antinode-offset 1))
    "Given a list of antenna positions of a single frequency, generate the antinodes"
    (let ((counter 0))
      (cond
       ((= 1 (length antennas)) 0)
       (t (loop for antenna in (cdr antennas)
		do (loop for antinode-pos in (get-antinodes-positions
					      antenna
					      (car antennas)
					      :delta-x delta-x
					      :delta-y delta-y
					      :min-antinode-offset min-antinode-offset
					      :max-antinode-offset max-antinode-offset)
			 when (and
			       (not (out-of-bounds antinode-pos nrows ncols))
			       (not (counted-p antinode-pos counted)))
			 do ; (format t "~a~%" antinode-pos)
			 (incf counter)
			 (set-counted antinode-pos counted)))
	  (incf counter (count-antinodes
			 (cdr antennas)
			 nrows
			 ncols
			 counted
			 :delta-x delta-x
			 :delta-y delta-y
			 :min-antinode-offset min-antinode-offset
			 :max-antinode-offset max-antinode-offset))))
      counter))

  (defun print-counted (counted)
    (loop for i from 0 below (array-dimension counted 1)
	  do (when (> i 0) (format t "~%"))
	  (loop for j from 0 below (array-dimension counted 0)
		do (if (aref counted i j)
		       (format t "#")
		     (format t ".")))))


  (defun solve-1 (file)
    (let* ((lines (uiop:read-file-lines file))
	   (grid (parse-grid lines))
	   (nrows (grid-nrows grid))
	   (ncols (grid-ncols grid))
	   (counted (make-array (list nrows ncols) :initial-element nil)))
      (loop for antennas being the hash-value of (grid-antennas grid)
	    sum (count-antinodes antennas nrows ncols counted
				 :delta-x #'(lambda (pos1 pos2) (abs (- (second pos1) (second pos2))))
				 :delta-y #'(lambda (pos1 pos2) (abs (- (first pos1) (first pos2))))
				 :min-antinode-offset 1
				 :max-antinode-offset 1))))


  (defun solve-2 (file)
    (let* ((lines (uiop:read-file-lines file))
	   (grid (parse-grid lines))
	   (nrows (grid-nrows grid))
	   (ncols (grid-ncols grid))
	   (counted (make-array (list nrows ncols) :initial-element nil)))
      (loop for antennas being the hash-value of (grid-antennas grid)
	    sum (count-antinodes antennas nrows ncols counted
				 :delta-x #'(lambda (pos1 pos2) (abs (- (second pos1) (second pos2))))
				 :delta-y #'(lambda (pos1 pos2) (abs (- (first pos1) (first pos2))))
				 :min-antinode-offset 0
				 :max-antinode-offset nrows))))
#+end_src

