dist/aoc2024.html
<div id="outline-container-day-8" class="outline-2">
<h2 id="day-8">Day 8</h2>
<div class="outline-text-2" id="text-day-8">
<p>
I tried to make <code>get-antinodes-positions</code> and <code>count-antinodes</code> as most
general as possible even if I know that just copy-pasting the functions
and making small edits would've solved the problem anyway.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defstruct</span> <span class="org-type">grid</span> (antennas nil) (nrows nil) (ncols nil))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-grid</span> (lines)
  (<span class="org-keyword">let</span> ((frequencies (make-hash-table))
          (nrows (length lines))
          (ncols (length (first lines))))
    (<span class="org-keyword">loop</span> for row from 0 below nrows
            nconc (<span class="org-keyword">loop</span> for col from 0 below ncols
                        do (<span class="org-keyword">let</span> ((current-char (char (nth row lines) col)))
                             (<span class="org-keyword">when</span> (char-not-equal current-char #\.)
                               (push (list row col) (gethash current-char frequencies))))))
    (make-grid <span class="org-builtin">:antennas</span> frequencies <span class="org-builtin">:nrows</span> nrows <span class="org-builtin">:ncols</span> ncols)))

(<span class="org-keyword">defun</span> <span class="org-function-name">get-antinodes-positions</span> (antenna-1 antenna-2 <span class="org-type">&amp;key</span> (delta-x 1) (delta-y 1) (min-antinode-offset 1) (max-antinode-offset 1))
  (<span class="org-keyword">destructuring-bind</span> (a1 a2)
                        (<span class="org-keyword">if</span> (utils:compare-lists antenna-1 antenna-2)
                            (list antenna-1 antenna-2)
                          (list antenna-2 antenna-1))
                        (<span class="org-keyword">let*</span> ((a1-x (second a1)) (a1-y (first a1))
                               (a2-x (second a2)) (a2-y (first a2))
                               (delta-x (<span class="org-keyword">if</span> (functionp delta-x)
                                            (funcall delta-x a1 a2)
                                          delta-x))
                               (delta-y (<span class="org-keyword">if</span> (functionp delta-y)
                                            (funcall delta-y a1 a2)
                                          delta-y)))
                          (<span class="org-keyword">loop</span> for i from min-antinode-offset to max-antinode-offset
                                for computed-delta-x = (* i delta-x)
                                for computed-delta-y = (* i delta-y)
                                if (&lt;= a1-x a2-x)
                                nconc (list (list (- a1-y computed-delta-y) (- a1-x computed-delta-x))
                                            (list (+ a2-y computed-delta-y) (+ a2-x computed-delta-x)))
                                else
                                nconc (list (list (- a1-y computed-delta-y) (+ a1-x computed-delta-x))
                                            (list (+ a2-y computed-delta-y) (- a2-x computed-delta-x)))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">out-of-bounds-p</span> (position nrows ncols)
  (<span class="org-keyword">let</span> ((col (second position))
          (row (first position)))
    (or (&lt; col 0) (&lt; row 0) (&gt;= col ncols) (&gt;= row nrows))))

(<span class="org-keyword">defun</span> <span class="org-function-name">counted-p</span> (position counted)
  (aref counted (first position) (second position)))

(<span class="org-keyword">defun</span> <span class="org-function-name">set-counted</span> (position counted)
  <span class="org-doc">"Set the position as counted. Modifies counted (an array)."</span>
  (setf (aref counted (first position) (second position)) t))


(<span class="org-keyword">defun</span> <span class="org-function-name">count-antinodes</span> (antennas nrows ncols counted <span class="org-type">&amp;key</span> (delta-x 1) (delta-y 1) (min-antinode-offset 1) (max-antinode-offset 1))
  <span class="org-doc">"Given a list of antenna positions of a single frequency, generate the antinodes"</span>
  (<span class="org-keyword">let</span> ((counter 0))
    (<span class="org-keyword">cond</span>
     ((= 1 (length antennas)) 0)
     (t (<span class="org-keyword">loop</span> for antenna in (cdr antennas)
                do (<span class="org-keyword">loop</span> for antinode-pos in (get-antinodes-positions
                                              antenna
                                              (car antennas)
                                              <span class="org-builtin">:delta-x</span> delta-x
                                              <span class="org-builtin">:delta-y</span> delta-y
                                              <span class="org-builtin">:min-antinode-offset</span> min-antinode-offset
                                              <span class="org-builtin">:max-antinode-offset</span> max-antinode-offset)
                         when (and
                               (not (out-of-bounds antinode-pos nrows ncols))
                               (not (counted-p antinode-pos counted)))
                         do <span class="org-comment">; (format t "~a~%" antinode-pos)</span>
                         (incf counter)
                         (set-counted antinode-pos counted)))
          (incf counter (count-antinodes
                         (cdr antennas)
                         nrows
                         ncols
                         counted
                         <span class="org-builtin">:delta-x</span> delta-x
                         <span class="org-builtin">:delta-y</span> delta-y
                         <span class="org-builtin">:min-antinode-offset</span> min-antinode-offset
                         <span class="org-builtin">:max-antinode-offset</span> max-antinode-offset))))
    counter))

(<span class="org-keyword">defun</span> <span class="org-function-name">print-counted</span> (counted)
  (<span class="org-keyword">loop</span> for i from 0 below (array-dimension counted 1)
          do (<span class="org-keyword">when</span> (&gt; i 0) (format t <span class="org-string">"~%"</span>))
          (<span class="org-keyword">loop</span> for j from 0 below (array-dimension counted 0)
                do (<span class="org-keyword">if</span> (aref counted i j)
                       (format t <span class="org-string">"#"</span>)
                     (format t <span class="org-string">"."</span>)))))


(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (grid (parse-grid lines))
           (nrows (grid-nrows grid))
           (ncols (grid-ncols grid))
           (counted (make-array (list nrows ncols) <span class="org-builtin">:initial-element</span> nil)))
    (<span class="org-keyword">loop</span> for antennas being the hash-value of (grid-antennas grid)
            sum (count-antinodes antennas nrows ncols counted
                                 <span class="org-builtin">:delta-x</span> #'(<span class="org-keyword">lambda</span> (pos1 pos2) (abs (- (second pos1) (second pos2))))
                                 <span class="org-builtin">:delta-y</span> #'(<span class="org-keyword">lambda</span> (pos1 pos2) (abs (- (first pos1) (first pos2))))
                                 <span class="org-builtin">:min-antinode-offset</span> 1
                                 <span class="org-builtin">:max-antinode-offset</span> 1))))


(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (grid (parse-grid lines))
           (nrows (grid-nrows grid))
           (ncols (grid-ncols grid))
           (counted (make-array (list nrows ncols) <span class="org-builtin">:initial-element</span> nil)))
    (<span class="org-keyword">loop</span> for antennas being the hash-value of (grid-antennas grid)
            sum (count-antinodes antennas nrows ncols counted
                                 <span class="org-builtin">:delta-x</span> #'(<span class="org-keyword">lambda</span> (pos1 pos2) (abs (- (second pos1) (second pos2))))
                                 <span class="org-builtin">:delta-y</span> #'(<span class="org-keyword">lambda</span> (pos1 pos2) (abs (- (first pos1) (first pos2))))
                                 <span class="org-builtin">:min-antinode-offset</span> 0
                                 <span class="org-builtin">:max-antinode-offset</span> nrows))))
</pre>
</div>
</div>
</div>
