src/aoc2024.org
** Day 9
:PROPERTIES:
:CUSTOM_ID: day-9
:END:
#+begin_src lisp
  (load "../utils.lisp")

  (defun parse-disk-map (line)
    (let ((id 0)
	  (parsed nil))
      (loop for char across line
	    for num = (digit-char-p char)
	    for pos from 0 below (length line)
	    if (oddp pos)
	      do (loop for j from 1 to num do (push 'dot parsed))
	    else
	      do (loop for j from 1 to num do (push id parsed))
		 (incf id))
      (reverse parsed)))

  (defun get-empty-space-positions (disk-map)
    (loop with in-empty-space = nil
	  with start-pos = 0
	  with end-pos = 0
	  for file in disk-map
	  for pos from 0 below (length disk-map)
	  when (and (not in-empty-space) (eq file 'dot))
	    do (setf in-empty-space t)
	       (setf start-pos pos)
	  when (and in-empty-space (not (eq file 'dot)))
	    do (setf in-empty-space nil)
	       (setf end-pos pos)
	    and collect (list start-pos end-pos)))

  (defun get-file-positions (disk-map)
    (loop with file-positions = (make-hash-table)
	  with file-id = 0
	  with start-pos = 0
	  with end-pos = 0
	  with in-empty-space = nil
	  for file in disk-map
	  for pos from 0 below (length disk-map)
	  when (and (not (eq file 'dot)) in-empty-space (/= file file-id))
	    do (setf file-id file)
	       (setf start-pos pos)
	       (setf in-empty-space nil)
	  when (and (not (eq file 'dot)) in-empty-space (/= file file-id))
	    do (setf file-id file)
	       (setf start-pos pos)
	       (setf in-empty-space nil)
	  when (and (not (eq file 'dot)) (not in-empty-space) (/= file file-id))
	    do (setf end-pos pos)
	       (setf (gethash file-id file-positions) (list start-pos end-pos))
	       (setf file-id file)
	       (setf start-pos pos)
	  when (and (not in-empty-space) (eq file 'dot))
	    do (setf in-empty-space t)
	       (setf end-pos pos)
	       (setf (gethash file-id file-positions) (list start-pos end-pos))
	  finally (setf (gethash file-id file-positions) (list start-pos (1+ pos)))
		  (return file-positions)))

  (defun move-file-block (disk-map last-empty-pos)
    (when disk-map
      (let* ((dot-pos (position 'dot (subseq disk-map last-empty-pos)))
	     (empty-pos (when dot-pos (+ last-empty-pos dot-pos))))
	(cond
	  ((and empty-pos (= empty-pos (1- (length disk-map))))
	   (list (butlast disk-map) empty-pos nil))
	  (empty-pos
	   (list (append
		  (subseq disk-map 0 empty-pos)
		  (last disk-map)
		  (butlast (subseq disk-map (1+ empty-pos))))
		 empty-pos
		 nil))
	  (t (list disk-map empty-pos t))))))

  (defun move-file-blocks (disk-map)
    (loop with last-disk-map = (copy-list disk-map)
	  with fixpoint = nil
	  with last-empty-pos = 0
	  while (not fixpoint)
	  do (destructuring-bind
		 (new-disk-map empty-pos fixpoint-p)
		 (move-file-block last-disk-map last-empty-pos)
	       (setf last-empty-pos empty-pos)
	       (setf fixpoint fixpoint-p)
	       (setf last-disk-map new-disk-map))
	  finally (return last-disk-map)))

  (defun empty-intervals-before (position empty-intervals)
    (remove-if #'(lambda (pos) (>= (first pos) (second position))) empty-intervals))

  (defun find-fitting-position (file-position empty-intervals)
    (position-if #'(lambda (pos) (>= (- (second pos) (first pos)) (- (second file-position) (first file-position)))) empty-intervals))

  (defun move-exact-file-blocks (file-intervals empty-intervals)
    (let ((file-ids (sort (loop for k being the hash-key of file-intervals collect k) #'>))
	  (remaining-empty-intervals (copy-list empty-intervals))
	  (new-file-intervals (make-hash-table)))
      (loop for id in file-ids
	    for file-interval = (gethash id file-intervals)
	    for fit = (find-fitting-position
		       file-interval
		       (empty-intervals-before file-interval remaining-empty-intervals))
	    if fit
	      do (let* ((fitting-interval (nth fit remaining-empty-intervals))
			(filled-from (first fitting-interval))
			(filled-to (+ filled-from (- (second file-interval) (first file-interval))))
			(filled-interval (list filled-from filled-to))
			(leftover-interval (list filled-to (second fitting-interval))))
		   (setf (gethash id new-file-intervals) filled-interval)
		   (if (equal leftover-interval fitting-interval)
		       ;; if the fitting interval is filled, remove it from the empty intervals list
		       (setf remaining-empty-intervals (remove (nth fit remaining-empty-intervals) remaining-empty-intervals))
		       ;; otherwise replace the empty interva with the leftover interval after moving the file block
		       (setf remaining-empty-intervals
			     (replace remaining-empty-intervals (list leftover-interval)
				      :start1 fit 
				      :end1 (1+ fit)))))
	    else
	      do (setf (gethash id new-file-intervals) (gethash id file-intervals)))
      new-file-intervals))

  (defun hash-map-to-alist (hash-map)
    (loop for key being the hash-key of hash-map
	    using (hash-value value)
	  collect (cons key (list value))))


  (defun solve-1 (file)
    (let* ((line (uiop:read-file-line file))
	   (disk-map (parse-disk-map line))
	   (moved-disk-map (move-file-blocks disk-map)))
      (loop for position from 0 below (length moved-disk-map)
	    for file-id in moved-disk-map
	    sum (* position file-id))))


  (defun solve-2 (file)
    (let* ((disk-map (parse-disk-map (uiop:read-file-line file)))
	   (empty-spaces (get-empty-space-positions disk-map))
	   (file-positions (get-file-positions disk-map))
	   (moved-file-positions (move-exact-file-blocks file-positions empty-spaces))
	   (sorted (sort (hash-map-to-alist moved-file-positions) #'< :key #'(lambda (id-pos) (caadr id-pos)))))
      (loop for file in sorted
	    for start = (caadr file) ; I felt fancy, just to take the first element of the second element
	    for end = (1- (cadadr file)) ; I felt even fancier
	    for pos-sum = (* (/ (+ start end) 2) (+ (- end start) 1))
	    sum (* (car file) pos-sum))))
#+end_src

