dist/aoc2024.html
<div id="outline-container-day-9" class="outline-2">
<h2 id="day-9">Day 9</h2>
<div class="outline-text-2" id="text-day-9">
<div class="org-src-container">
<pre class="src src-lisp">(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-disk-map</span> (line)
  (<span class="org-keyword">let</span> ((id 0)
          (parsed nil))
    (<span class="org-keyword">loop</span> for char across line
            for num = (digit-char-p char)
            for pos from 0 below (length line)
            if (oddp pos)
              do (<span class="org-keyword">loop</span> for j from 1 to num do (push 'dot parsed))
            else
              do (<span class="org-keyword">loop</span> for j from 1 to num do (push id parsed))
                 (incf id))
    (reverse parsed)))

(<span class="org-keyword">defun</span> <span class="org-function-name">get-empty-space-positions</span> (disk-map)
  (<span class="org-keyword">loop</span> with in-empty-space = nil
          with start-pos = 0
          with end-pos = 0
          for file in disk-map
          for pos from 0 below (length disk-map)
          when (and (not in-empty-space) (eq file 'dot))
            do (setf in-empty-space t)
               (setf start-pos pos)
          when (and in-empty-space (not (eq file 'dot)))
            do (setf in-empty-space nil)
               (setf end-pos pos)
            and collect (list start-pos end-pos)))

(<span class="org-keyword">defun</span> <span class="org-function-name">get-file-positions</span> (disk-map)
  (<span class="org-keyword">loop</span> with file-positions = (make-hash-table)
          with file-id = 0
          with start-pos = 0
          with end-pos = 0
          with in-empty-space = nil
          for file in disk-map
          for pos from 0 below (length disk-map)
          when (and (not (eq file 'dot)) in-empty-space (/= file file-id))
            do (setf file-id file)
               (setf start-pos pos)
               (setf in-empty-space nil)
          when (and (not (eq file 'dot)) in-empty-space (/= file file-id))
            do (setf file-id file)
               (setf start-pos pos)
               (setf in-empty-space nil)
          when (and (not (eq file 'dot)) (not in-empty-space) (/= file file-id))
            do (setf end-pos pos)
               (setf (gethash file-id file-positions) (list start-pos end-pos))
               (setf file-id file)
               (setf start-pos pos)
          when (and (not in-empty-space) (eq file 'dot))
            do (setf in-empty-space t)
               (setf end-pos pos)
               (setf (gethash file-id file-positions) (list start-pos end-pos))
          finally (setf (gethash file-id file-positions) (list start-pos (1+ pos)))
                  (<span class="org-keyword">return</span> file-positions)))

(<span class="org-keyword">defun</span> <span class="org-function-name">move-file-block</span> (disk-map last-empty-pos)
  (<span class="org-keyword">when</span> disk-map
    (<span class="org-keyword">let*</span> ((dot-pos (position 'dot (subseq disk-map last-empty-pos)))
             (empty-pos (<span class="org-keyword">when</span> dot-pos (+ last-empty-pos dot-pos))))
        (<span class="org-keyword">cond</span>
          ((and empty-pos (= empty-pos (1- (length disk-map))))
           (list (butlast disk-map) empty-pos nil))
          (empty-pos
           (list (append
                  (subseq disk-map 0 empty-pos)
                  (last disk-map)
                  (butlast (subseq disk-map (1+ empty-pos))))
                 empty-pos
                 nil))
          (t (list disk-map empty-pos t))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">move-file-blocks</span> (disk-map)
  (<span class="org-keyword">loop</span> with last-disk-map = (copy-list disk-map)
          with fixpoint = nil
          with last-empty-pos = 0
          while (not fixpoint)
          do (<span class="org-keyword">destructuring-bind</span>
                 (new-disk-map empty-pos fixpoint-p)
                 (move-file-block last-disk-map last-empty-pos)
               (setf last-empty-pos empty-pos)
               (setf fixpoint fixpoint-p)
               (setf last-disk-map new-disk-map))
          finally (<span class="org-keyword">return</span> last-disk-map)))

(<span class="org-keyword">defun</span> <span class="org-function-name">empty-intervals-before</span> (position empty-intervals)
  (remove-if #'(<span class="org-keyword">lambda</span> (pos) (&gt;= (first pos) (second position))) empty-intervals))

(<span class="org-keyword">defun</span> <span class="org-function-name">find-fitting-position</span> (file-position empty-intervals)
  (position-if #'(<span class="org-keyword">lambda</span> (pos) (&gt;= (- (second pos) (first pos)) (- (second file-position) (first file-position)))) empty-intervals))

(<span class="org-keyword">defun</span> <span class="org-function-name">move-exact-file-blocks</span> (file-intervals empty-intervals)
  (<span class="org-keyword">let</span> ((file-ids (sort (<span class="org-keyword">loop</span> for k being the hash-key of file-intervals collect k) #'&gt;))
          (remaining-empty-intervals (copy-list empty-intervals))
          (new-file-intervals (make-hash-table)))
    (<span class="org-keyword">loop</span> for id in file-ids
            for file-interval = (gethash id file-intervals)
            for fit = (find-fitting-position
                       file-interval
                       (empty-intervals-before file-interval remaining-empty-intervals))
            if fit
              do (<span class="org-keyword">let*</span> ((fitting-interval (nth fit remaining-empty-intervals))
                        (filled-from (first fitting-interval))
                        (filled-to (+ filled-from (- (second file-interval) (first file-interval))))
                        (filled-interval (list filled-from filled-to))
                        (leftover-interval (list filled-to (second fitting-interval))))
                   (setf (gethash id new-file-intervals) filled-interval)
                   (<span class="org-keyword">if</span> (equal leftover-interval fitting-interval)
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">if the fitting interval is filled, remove it from the empty intervals list</span>
                       (setf remaining-empty-intervals (remove (nth fit remaining-empty-intervals) remaining-empty-intervals))
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">otherwise replace the empty interva with the leftover interval after moving the file block</span>
                       (setf remaining-empty-intervals
                             (replace remaining-empty-intervals (list leftover-interval)
                                      <span class="org-builtin">:start1</span> fit 
                                      <span class="org-builtin">:end1</span> (1+ fit)))))
            else
              do (setf (gethash id new-file-intervals) (gethash id file-intervals)))
    new-file-intervals))

(<span class="org-keyword">defun</span> <span class="org-function-name">hash-map-to-alist</span> (hash-map)
  (<span class="org-keyword">loop</span> for key being the hash-key of hash-map
            using (hash-value value)
          collect (cons key (list value))))


(<span class="org-keyword">defun</span> <span class="org-function-name">solve-1</span> (file)
  (<span class="org-keyword">let*</span> ((line (uiop:read-file-line file))
           (disk-map (parse-disk-map line))
           (moved-disk-map (move-file-blocks disk-map)))
    (<span class="org-keyword">loop</span> for position from 0 below (length moved-disk-map)
            for file-id in moved-disk-map
            sum (* position file-id))))


(<span class="org-keyword">defun</span> <span class="org-function-name">solve-2</span> (file)
  (<span class="org-keyword">let*</span> ((disk-map (parse-disk-map (uiop:read-file-line file)))
           (empty-spaces (get-empty-space-positions disk-map))
           (file-positions (get-file-positions disk-map))
           (moved-file-positions (move-exact-file-blocks file-positions empty-spaces))
           (sorted (sort (hash-map-to-alist moved-file-positions) #'&lt; <span class="org-builtin">:key</span> #'(<span class="org-keyword">lambda</span> (id-pos) (caadr id-pos)))))
    (<span class="org-keyword">loop</span> for file in sorted
            for start = (caadr file) <span class="org-comment">; I felt fancy, just to take the first element of the second element</span>
            for end = (1- (cadadr file)) <span class="org-comment">; I felt even fancier</span>
            for pos-sum = (* (/ (+ start end) 2) (+ (- end start) 1))
            sum (* (car file) pos-sum))))
</pre>
</div>
</div>
</div>
