src/aoc2024.org
** Day 10

#+begin_src lisp
  (load "../utils.lisp")

  (defclass graph ()
    ((nodes :documentation "List of node labels. The node id is the position of the node in the list."
	    :accessor nodes
	    :initarg :nodes)
     (edges :documentation "Hash map of the edges. The keys are the node
     ids and the edges are pairs (q c) where q is the id of a node and c
     is the cost of the edge"
	    :accessor edges
	    :initarg :edges
	    :initform (make-hash-table))))

  (defmethod neighbors ((graph graph) node)
    (gethash node (edges graph)))

  (defmethod add-neighbor ((graph graph) node neighbor cost)
    (push (list neighbor cost) (gethash node (edges graph))))

  (defun dfs-search (graph node visited &optional (feasible #'identity) (paths nil))
    (let ((reachable
	    (mapcan
	     #'(lambda (neighbor-cost)
		 (let ((neighbor (first neighbor-cost)))
		   (when (and paths (funcall feasible neighbor-cost) (gethash neighbor visited))
		     (incf (gethash neighbor paths))
		     (dfs-search graph neighbor visited feasible paths))
		   (when (and (funcall feasible neighbor-cost) (not (gethash neighbor visited)))
		     (setf (gethash neighbor visited) t)
		     (cond
		       (paths
			(setf (gethash neighbor paths) (gethash node paths))
			(dfs-search graph neighbor visited feasible paths))
		       (t (dfs-search graph neighbor visited feasible))))))
	     (neighbors graph node))))
      (values (cons node reachable) paths)))

  (defgeneric reachable-from (graph node &optional count-all-paths)
    (:documentation "Reachability."))

  (defmethod reachable-from ((graph graph) node &optional (count-all-paths nil))
    (if count-all-paths
	(let ((paths (make-hash-table)))
	  (setf (gethash node paths) 1)
	  (dfs-search graph
		      node
		      (make-hash-table)
		      #'(lambda (neighbor-cost) (eq 1 (second neighbor-cost)))
		      paths))
	(dfs-search graph
		    node
		    (make-hash-table)
		    #'(lambda (neighbor-cost) (eq 1 (second neighbor-cost))))))

  (defmethod nodes-with-label ((graph graph) label)
    (loop for node in (nodes graph)
	  for idx from 0 below (length (nodes graph))
	  when (eq node label) collect idx))

  (defun parse-lines (lines)
    (loop for line in lines
	  collect (loop for char across line collect (digit-char-p char))))

  (defun edge-cost (lines row col direction)
    (cond
      ((eq direction 'top)
       (- (nth col (nth (1- row) lines)) (nth col (nth row lines))))
      ((eq direction 'bottom)
       (- (nth col (nth (1+ row) lines)) (nth col (nth row lines))))
      ((eq direction 'right)
       (- (nth (1+ col) (nth row lines)) (nth col (nth row lines))))
      ((eq direction 'left)
       (- (nth (1- col) (nth row lines)) (nth col (nth row lines))))
      (t (error "direction should be one of 'top 'bottom 'right 'left."))))

  (defun parse-graph (lines)
    (let ((graph (make-instance 'graph :nodes nil))
	  (nrows (length lines))
	  (ncols (length (first lines))))
      (loop for row from 0 below nrows
	    do (loop for col from 0 below ncols
		     for current = (+ (* row ncols) col)
		     for top = (+ (* (1- row) ncols) col)
		     for left = (+ (* row ncols) (1- col))
		     for right = (+ (* row ncols) (1+ col))
		     for bottom = (+ (* (1+ row) ncols) col)
		     do (setf (nodes graph) (append (nodes graph) (list (nth col (nth row lines))))) 
		     when (>= (1- row) 0)
		       do (add-neighbor graph current top (edge-cost lines row col 'top))
		     when (< (1+ row) nrows)
		       do (add-neighbor graph current bottom (edge-cost lines row col 'bottom))
		     when (>= (1- col) 0)
		       do (add-neighbor graph current left (edge-cost lines row col 'left))
		     when (< (1+ col) ncols)
		       do (add-neighbor graph current right (edge-cost lines row col 'right))))
      graph))


  (defun solve-1 (file)
    (let* ((lines (parse-lines (uiop:read-file-lines file)))
	   (graph (parse-graph lines)))
      (reduce #'+ (mapcar #'(lambda (list) (count 9 list))
			  (loop for node in (nodes-with-label graph 0)
				collect (mapcar
					 #'(lambda (node-idx) (nth node-idx (nodes graph)))
					 (reachable-from graph node)))))))

  (defun solve-2 (file)
    (let* ((lines (parse-lines (uiop:read-file-lines file)))
	   (graph (parse-graph lines)))
      (reduce #'+
	      (loop for node in (nodes-with-label graph 0)
		    nconc (multiple-value-bind
				(reachable paths) (reachable-from graph node t)
			    (loop for node-idx in reachable
				  when (eq 9 (nth node-idx (nodes graph)))
				    collect (gethash node-idx paths)))))))
#+end_src

** Day 11

#+begin_src lisp
  (load "../utils.lisp")

  (defun parse-numbers (numbers)
    (mapcar #'parse-integer (utils:split-by-one-space numbers)))

  (defun apply-rule (number)
    (let* ((number-string (princ-to-string number))
	   (num-of-digits (length number-string)))
     (cond
      ((= number 0) (list 1))
      ((evenp num-of-digits)
       (list (parse-integer (subseq number-string 0 (/ num-of-digits 2)))
	     (parse-integer (subseq number-string (/ num-of-digits 2)))))
      (t (list (* 2024 number))))))

  (defun apply-rule-to-list-aux (number-list times)
    (if (= 0 times)
	(length number-list)
	(apply-rule-to-list (mapcan #'apply-rule number-list) (1- times))))

  (utils:apply-memoization 'apply-rule-to-list-aux)

  (defun apply-rule-to-list (number-list &optional (times 1))
    (reduce #'+ (mapcar #'(lambda (num) (apply-rule-to-list-aux (list num) times)) number-list)))

  (utils:apply-memoization 'apply-rule-to-list)

  (defun solve-1 (file)
    (let* ((line (uiop:read-file-line file))
	   (number-list (parse-numbers line)))
      (apply-rule-to-list number-list 25)))

  (defun solve-2 (file)
    (let* ((line (uiop:read-file-line file))
	   (number-list (parse-numbers line)))
      (apply-rule-to-list number-list 75)))
#+end_src

