dist/aoc2024.html
<div id="outline-container-org66d93fb" class="outline-2">
<h2 id="org66d93fb">Day 12</h2>
<div class="outline-text-2" id="text-org66d93fb">
<div class="org-src-container">
<pre class="src src-lisp">(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defclass</span> <span class="org-type">edge</span> ()
  ((from <span class="org-builtin">:accessor</span> from
           <span class="org-builtin">:initarg</span> <span class="org-builtin">:from</span>)
   (to <span class="org-builtin">:accessor</span> to
         <span class="org-builtin">:initarg</span> <span class="org-builtin">:to</span>)
   (cost <span class="org-builtin">:accessor</span> cost
           <span class="org-builtin">:initarg</span> <span class="org-builtin">:cost</span>
           <span class="org-builtin">:initform</span> 0)
   (label <span class="org-builtin">:accessor</span> label
            <span class="org-builtin">:initarg</span> <span class="org-builtin">:label</span>
            <span class="org-builtin">:initform</span> nil)))

(<span class="org-keyword">defclass</span> <span class="org-type">graph</span> ()
  ((nodes <span class="org-builtin">:documentation</span> <span class="org-doc">"List of node labels. The node id is the position of the node in the list."</span>
            <span class="org-builtin">:accessor</span> nodes
            <span class="org-builtin">:initarg</span> <span class="org-builtin">:nodes</span>)
   (edges <span class="org-builtin">:documentation</span> <span class="org-doc">"Hash map of the edges. The keys are the node</span>
<span class="org-doc">   ids and the edges are pairs (q c) where q is the id of a node and c</span>
<span class="org-doc">   is the cost of the edge"</span>
            <span class="org-builtin">:accessor</span> edges
            <span class="org-builtin">:initarg</span> <span class="org-builtin">:edges</span>
            <span class="org-builtin">:initform</span> (make-hash-table))))

(<span class="org-keyword">defgeneric</span> <span class="org-function-name">neighbors</span> (graph node)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Returns the neighbors of node in graph."</span>))

(<span class="org-keyword">defmethod</span> <span class="org-function-name">neighbors</span> ((graph graph) node)
  (gethash node (edges graph)))

(<span class="org-keyword">defgeneric</span> <span class="org-function-name">add-neighbor</span> (graph node neighbor <span class="org-type">&amp;key</span> cost label)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Adds an edge in graph from node to neighbor."</span>))

(<span class="org-keyword">defmethod</span> <span class="org-function-name">add-neighbor</span> ((graph graph) node neighbor <span class="org-type">&amp;key</span> (cost 0) (label nil))
  (push (make-instance 'edge <span class="org-builtin">:from</span> node <span class="org-builtin">:to</span> neighbor <span class="org-builtin">:cost</span> cost <span class="org-builtin">:label</span> label) (gethash node (edges graph))))

(<span class="org-keyword">defgeneric</span> <span class="org-function-name">nodes-with-label</span> (graph label)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Returns all the node ids of the nodes that have the iven lavel"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">transform-point</span> (point)
  (<span class="org-keyword">destructuring-bind</span> (row col) point
    (list (list row col)
            (list row (1+ col))
            (list (1+ row) col)
            (list (1+ row) (1+ col)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse-graph</span> (lines)
  <span class="org-doc">"Parses a text matrix and builds a graph where two nodes are connected by an edge only if they have the same label."</span>
  (<span class="org-keyword">let</span> ((graph (make-instance 'graph <span class="org-builtin">:nodes</span> nil))
          (nrows (length lines))
          (ncols (length (first lines))))
    (<span class="org-keyword">loop</span> for row from 0 below nrows
            do (<span class="org-keyword">loop</span> for col from 0 below ncols
                     for current = (+ (* row ncols) col)
                     for top = (+ (* (1- row) ncols) col)
                     for left = (+ (* row ncols) (1- col))
                     for right = (+ (* row ncols) (1+ col))
                     for bottom = (+ (* (1+ row) ncols) col)
                     do (push (list (elt (elt lines row) col) (transform-point (list row col))) (nodes graph))
                        <span class="org-comment-delimiter">;; </span><span class="org-comment">add an edge only if the labels are equal</span>
                     when (and (&gt;= (1- row) 0 ) (equal (elt (elt lines row) col) (elt (elt lines (1- row)) col)))
                       do (add-neighbor graph current top <span class="org-builtin">:label</span> 'top)
                     when (and (&lt; (1+ row) nrows) (equal (elt (elt lines row) col) (elt (elt lines (1+ row)) col)))
                       do (add-neighbor graph current bottom <span class="org-builtin">:label</span> 'bottom)
                     when (and (&gt;= (1- col) 0) (equal (elt (elt lines row) col) (elt (elt lines row) (1- col))))
                       do (add-neighbor graph current left <span class="org-builtin">:label</span> 'left)
                     when (and (&lt; (1+ col) ncols) (equal (elt (elt lines row) col) (elt (elt lines row) (1+ col))))
                       do (add-neighbor graph current right <span class="org-builtin">:label</span> 'right)))
    (setf (nodes graph) (reverse (nodes graph)))
    graph))

(<span class="org-keyword">defun</span> <span class="org-function-name">dfs-search</span> (graph node visited <span class="org-type">&amp;optional</span> (feasible #'identity))
  (setf (gethash node visited) t)
  (<span class="org-keyword">let</span> ((reachable
            (mapcan
             #'(<span class="org-keyword">lambda</span> (edge)
                 (<span class="org-keyword">let</span> ((neighbor (to edge)))
                   (<span class="org-keyword">when</span> (and (funcall feasible neighbor) (not (gethash neighbor visited)))
                     (setf (gethash neighbor visited) t)
                     (dfs-search graph neighbor visited feasible))))
             (neighbors graph node))))
    (values (cons node reachable))))

(<span class="org-keyword">defgeneric</span> <span class="org-function-name">reachable-from</span> (graph node)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Reachability."</span>))

(<span class="org-keyword">defmethod</span> <span class="org-function-name">reachable-from</span> ((graph graph) node)
  (dfs-search graph node (make-hash-table)))

(<span class="org-keyword">defun</span> <span class="org-function-name">compute-price-perimeter</span> (graph node-cluster)
  (* (length node-cluster) <span class="org-comment">; area</span>
     (reduce #'+ <span class="org-comment">; perimeter, which is the sum of 4 - number of neighbors of node, over all nodes in the cluster</span>
               (mapcar #'(<span class="org-keyword">lambda</span> (node-idx) (- 4 (length (neighbors graph node-idx)))) node-cluster))))

(<span class="org-keyword">defstruct</span> <span class="org-type">segment</span> start end mergeable)

(<span class="org-keyword">defun</span> <span class="org-function-name">get-node-segments</span> (graph node-id)
  (utils:let+ (((_ points) (elt (nodes graph) node-id))
                 (segments nil)
                 (neighbors (neighbors graph node-id))
                 ((top-left top-right bot-left bot-right) points)
                 (label-equal #'(<span class="org-keyword">lambda</span> (dir edge) (equal dir (label edge))))
                 (mergeable (mapcar #'label neighbors)))
    (<span class="org-keyword">unless</span> (find 'top neighbors <span class="org-builtin">:test</span> label-equal)
        (push (make-segment <span class="org-builtin">:start</span> top-left
                            <span class="org-builtin">:end</span> top-right
                            <span class="org-builtin">:mergeable</span> (remove-if-not #'(<span class="org-keyword">lambda</span> (dir) (or (equal dir 'left) (equal dir 'right))) mergeable))
              segments))
    (<span class="org-keyword">unless</span> (find 'bottom neighbors <span class="org-builtin">:test</span> label-equal)
        (push (make-segment <span class="org-builtin">:start</span> bot-left
                            <span class="org-builtin">:end</span> bot-right
                            <span class="org-builtin">:mergeable</span> (remove-if-not #'(<span class="org-keyword">lambda</span> (dir) (or (equal dir 'left) (equal dir 'right))) mergeable))
              segments))
    (<span class="org-keyword">unless</span> (find 'right neighbors <span class="org-builtin">:test</span> label-equal)
        (push (make-segment <span class="org-builtin">:start</span> top-right
                            <span class="org-builtin">:end</span> bot-right
                            <span class="org-builtin">:mergeable</span> (remove-if-not #'(<span class="org-keyword">lambda</span> (dir) (or (equal dir 'top) (equal dir 'bottom))) mergeable))
              segments))
    (<span class="org-keyword">unless</span> (find 'left neighbors <span class="org-builtin">:test</span> label-equal)
        (push (make-segment <span class="org-builtin">:start</span> top-left
                            <span class="org-builtin">:end</span> bot-left
                            <span class="org-builtin">:mergeable</span> (remove-if-not #'(<span class="org-keyword">lambda</span> (dir) (or (equal dir 'top) (equal dir 'bottom))) mergeable))
              segments))
    segments))

(<span class="org-keyword">defun</span> <span class="org-function-name">merge-segments</span> (segment-a segment-b)
  (<span class="org-keyword">cond</span>
    ((eq nil segment-a) segment-b)
    ((eq nil segment-b) segment-a)
    (t (<span class="org-keyword">let</span> ((a-start (segment-start segment-a))
               (a-end (segment-end segment-a))
               (b-start (segment-start segment-b))
               (b-end (segment-end segment-b)))
           (<span class="org-keyword">if</span> (not (equal a-end b-start))
               (<span class="org-warning">error</span> <span class="org-string">"End of segment-a doesn't match with start of segment-b."</span>)
               (make-segment <span class="org-builtin">:start</span> a-start
                             <span class="org-builtin">:end</span> b-end
                             <span class="org-builtin">:mergeable</span> (intersection (segment-mergeable segment-a) (segment-mergeable segment-b))))))))


(<span class="org-keyword">defun</span> <span class="org-function-name">segment-compatible-p</span> (new-segment segment)
  (<span class="org-keyword">if</span> segment
        (and
         <span class="org-comment-delimiter">;; </span><span class="org-comment">segment ends where new-segment starts</span>
         (equal (segment-start new-segment) (segment-end segment))
         (or
          <span class="org-comment-delimiter">;; </span><span class="org-comment">new-segment is exactly on the x axis w.r.t. segment</span>
          (and (equal (car (segment-start segment)) (car (segment-end segment)))
               (equal (car (segment-end segment)) (car (segment-start new-segment)))
               (equal (car (segment-start new-segment)) (car (segment-end new-segment)))
               (find 'right (segment-mergeable segment)))
          <span class="org-comment-delimiter">;; </span><span class="org-comment">new-segment is exactly on the y axis w.r.t. segment</span>
          (and (equal (cdr (segment-start segment)) (cdr (segment-end segment)))
               (equal (cdr (segment-end segment)) (cdr (segment-start new-segment)))
               (equal (cdr (segment-start new-segment)) (cdr (segment-end new-segment)))
               (find 'bottom (segment-mergeable segment)))))
        nil))

(<span class="org-keyword">defun</span> <span class="org-function-name">merge-segment-in-list</span> (segment-list new-segment)
  (<span class="org-keyword">let*</span> ((segment-compatible-p #'(<span class="org-keyword">lambda</span> (segment) (segment-compatible-p new-segment segment)))
           (to-merge-pos (position-if segment-compatible-p segment-list)))
    (<span class="org-keyword">if</span> to-merge-pos
          (values (append (subseq segment-list 0 to-merge-pos)
                          (list (merge-segments (elt segment-list to-merge-pos) new-segment))
                          (subseq segment-list (1+ to-merge-pos)))
                  t)
          (values (cons new-segment segment-list) nil))))

(<span class="org-keyword">defun</span> <span class="org-function-name">print-node-cluster</span> (graph nrows ncols node-cluster)
  (<span class="org-keyword">let</span> ((grid (make-array (list nrows ncols) <span class="org-builtin">:initial-element</span> nil)))
    (<span class="org-keyword">dolist</span> (node node-cluster)
        (utils:let+ (((char points) (elt (nodes graph) node))
                     ((row col) (first points)))
          (setf (aref grid row col) char)))
    (<span class="org-keyword">loop</span> for row from 0 below nrows
            do (format t <span class="org-string">"~&amp;"</span>)
               (<span class="org-keyword">loop</span> for col from 0 below ncols
                     for cell = (aref grid row col)
                     if cell
                       do (format t <span class="org-string">"~a"</span> cell)
                     else
                       do (format t <span class="org-string">"."</span>)))
    (format t <span class="org-string">"~2%"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">compute-price-sides</span> (graph node-cluster)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(print-node-cluster graph (isqrt (length (nodes graph))) (isqrt (length (nodes graph))) node-cluster)</span>
  (<span class="org-keyword">let*</span> ((compare-segments #'(<span class="org-keyword">lambda</span> (segment-a segment-b)
                                 (<span class="org-keyword">if</span> (equal (segment-start segment-a) (segment-start segment-b))
                                     (utils:compare-lists (segment-end segment-a) (segment-end segment-b))
                                     (utils:compare-lists (segment-start segment-a) (segment-start segment-b)))))
           (segments-not-merged (sort (mapcan #'(<span class="org-keyword">lambda</span> (node-id) (get-node-segments graph node-id)) node-cluster) compare-segments))
           (segments (reduce #'merge-segment-in-list segments-not-merged <span class="org-builtin">:initial-value</span> nil)))
    (* (length node-cluster) <span class="org-comment">; area</span>
         (length segments))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve</span> (file problem-step)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (graph (parse-graph lines))
           (not-visited (<span class="org-keyword">loop</span> for node-idx from 0 below (length (nodes graph)) collect node-idx))
           (compute-price
             (<span class="org-keyword">if</span> (= problem-step 1)
                 #'compute-price-perimeter
                 #'compute-price-sides)))
    (<span class="org-keyword">loop</span> while not-visited 
            <span class="org-comment-delimiter">;; </span><span class="org-comment">find the nodes in the same cluster</span>
            for newly-visited = (reachable-from graph (pop not-visited))
            <span class="org-comment-delimiter">;; </span><span class="org-comment">remove those from the not-visited list</span>
            do (mapcar #'(<span class="org-keyword">lambda</span> (node-idx) (setf not-visited (remove node-idx not-visited))) newly-visited)
            sum (funcall compute-price graph newly-visited))))
</pre>
</div>
</div>
</div>
