src/aoc2024.org
** Day 13

The problem consists of a function optimization under some numerical
constraints. In particular, the /number of tokens/ is defined by $3A +
B$ where $A$ and $B$ represent the number of times that button A or B
are pressed. A well-known optimization method is given by the [[https://math.libretexts.org/Bookshelves/Calculus/Map%3A_Calculus__Early_Transcendentals_(Stewart)/14%3A_Partial_Derivatives/14.08%3A_Lagrange_Multipliers][Lagrange Multipliers,]]
which can be used to efficiently solve the
problem. Since all the equations in the problem input are linear, it
suffices to solve the system of equations given by:

\begin{cases}
ax A + bx B = px \\
ay A + by B = py
\end{cases}

Where $ax, ay, bx, by, px, py$ represent respectively the increment in
X, Y given by buttons A and B, and the prize position. By rewriting
the equations using the substitution method it's easy to get a closed
formula that gives both $A$ and $B$:

\begin{cases}
A = \frac{px - bx B}{ax} \\
B = \frac{py \cdot ax - ay \cdot px}{ax \cdot by - ay \cdot bx}
\end{cases}

*P.S.* The homemade regex engine from [[sec:day-3][day 3]] strikes again!

#+begin_src lisp
  (load "../utils.lisp")

  (defparameter *number-automaton*
    (utils:make-automaton :init 1 :end 2
			  :delta '((1 - number -> 2)
				   (2 - number -> 2))))

  (defun parse (lines)
    (let ((machines (utils:split lines :delimiter "")))
      (loop for machine-data in machines
	    collect (loop for string in machine-data
			  nconc (mapcar #'parse-integer
					  (utils:apply-on-automaton-list
					   (list *number-automaton*)
					   string))))))

  (defun solve-equations (ax ay bx by px py)
    (let* ((b (/ (- (* py ax) (* ay px))
		 (- (* ax by) (* ay bx))))
	   (a (/ (- px (* bx b))
		 ax)))
      (values a b)))

  (defun solve (file step)
    (let* ((lines (uiop:read-file-lines file))
	   (machine-params (parse lines)))
      (loop with coins = 0
	    for (ax ay bx by px py) in machine-params
	    for (a b) = (multiple-value-list
			 (solve-equations ax ay bx by
					  (if (= step 2) (+ 10000000000000 px) px)
					  (if (= step 2) (+ 10000000000000 py) py)))
	    when (and (integerp a) (integerp b))
	      do (incf coins (+ (* 3 a) b))
	    finally (return coins))))
#+end_src

