dist/aoc2024.html
<div id="outline-container-orgf8fd1e4" class="outline-2">
<h2 id="orgf8fd1e4">Day 13</h2>
<div class="outline-text-2" id="text-orgf8fd1e4">
<p>
The problem consists of a function optimization under some numerical
constraints. In particular, the <i>number of tokens</i> is defined by \(3A +
B\) where \(A\) and \(B\) represent the number of times that button A or B
are pressed. A well-known optimization method is given by the <a href="https://math.libretexts.org/Bookshelves/Calculus/Map%3A_Calculus__Early_Transcendentals_(Stewart)/14%3A_Partial_Derivatives/14.08%3A_Lagrange_Multipliers">Lagrange Multipliers,</a>
which can be used to efficiently solve the
problem. Since all the equations in the problem input are linear, it
suffices to solve the system of equations given by:
</p>

\begin{cases}
ax A + bx B = px \\
ay A + by B = py
\end{cases}

<p>
Where \(ax, ay, bx, by, px, py\) represent respectively the increment in
X, Y given by buttons A and B, and the prize position. By rewriting
the equations using the substitution method it's easy to get a closed
formula that gives both \(A\) and \(B\):
</p>

\begin{cases}
A = \frac{px - bx B}{ax} \\
B = \frac{py \cdot ax - ay \cdot px}{ax \cdot by - ay \cdot bx}
\end{cases}

<p>
<b>P.S.</b> The homemade regex engine from <a href="#orga428baa">day 3</a> strikes again!
</p>

<div class="org-src-container">
<pre class="src src-lisp">(load <span class="org-string">"../utils.lisp"</span>)

(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*number-automaton*</span>
  (utils:make-automaton <span class="org-builtin">:init</span> 1 <span class="org-builtin">:end</span> 2
                          <span class="org-builtin">:delta</span> '((1 - number -&gt; 2)
                                   (2 - number -&gt; 2))))

(<span class="org-keyword">defun</span> <span class="org-function-name">parse</span> (lines)
  (<span class="org-keyword">let</span> ((machines (utils:split lines <span class="org-builtin">:delimiter</span> <span class="org-string">""</span>)))
    (<span class="org-keyword">loop</span> for machine-data in machines
            collect (<span class="org-keyword">loop</span> for string in machine-data
                          nconc (mapcar #'parse-integer
                                          (utils:apply-on-automaton-list
                                           (list *number-automaton*)
                                           string))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve-equations</span> (ax ay bx by px py)
  (<span class="org-keyword">let*</span> ((b (/ (- (* py ax) (* ay px))
                 (- (* ax by) (* ay bx))))
           (a (/ (- px (* bx b))
                 ax)))
    (values a b)))

(<span class="org-keyword">defun</span> <span class="org-function-name">solve</span> (file step)
  (<span class="org-keyword">let*</span> ((lines (uiop:read-file-lines file))
           (machine-params (parse lines)))
    (<span class="org-keyword">loop</span> with coins = 0
            for (ax ay bx by px py) in machine-params
            for (a b) = (multiple-value-list
                         (solve-equations ax ay bx by
                                          (<span class="org-keyword">if</span> (= step 2) (+ 10000000000000 px) px)
                                          (<span class="org-keyword">if</span> (= step 2) (+ 10000000000000 py) py)))
            when (and (integerp a) (integerp b))
              do (incf coins (+ (* 3 a) b))
            finally (<span class="org-keyword">return</span> coins))))
</pre>
</div>
</div>
</div>
