src/aoc2024.org
** Utils
:PROPERTIES:
:CUSTOM_ID: utils
:END:
#+begin_src lisp
  (defpackage :utils
    (:use :cl)
    (:export
     #:string-join
     #:split-by-one-space
     #:compile-regex
     #:apply-on-automaton-list
     #:regex-match-all
     #:compare-lists
     #:let+
     #:string*
     #:apply-memoization))

  (in-package :utils)

  (defun string-join (fill-in strings)
    (let ((joined (first strings)))
      (dolist (s (rest strings))
	(setf joined (concatenate 'string joined fill-in s)))
      joined))

  ;; from https://lispcookbook.github.io/cl-cookbook/strings.html#breaking-strings-into-graphenes-sentences-lines-and-words
  (defun split-by-one-space (string)
    (loop for i = 0 then (1+ j)
	  as j = (position #\Space string :start i)
	  collect (subseq string i j)
	  while j))

  (defstruct automaton (init nil) (end nil) (delta '()))

  (defun rule-with-input (rules input)
    "returns the single rule that have input on the arrow"
    (let ((rule-list (remove-if-not #'(lambda (rule) (string= (third rule) input)) rules)))
      (if rule-list (first rule-list) nil)))

  (defun rule-with-number (rules)
    "returns the single rule that have -number->"
    (let ((rule-list (remove-if-not #'(lambda (rule) (eql (third rule) 'number)) rules)))
      (if rule-list (first rule-list) nil)))

  (defun rules-with-state (rules state)
    "returns list of rules for state"
      (remove-if-not #'(lambda (rule) (eql (first rule) state)) rules))

  (defun target-state (rule)
    (fifth rule))


  (defun apply-delta-char (delta state input)
    "Apply delta on a single char string."
    (let ((to-apply (rule-with-input (rules-with-state delta state) input)))
      (cond
	((equal delta nil) nil)
	(to-apply
	 (target-state to-apply))
	((and (position input "0123456789" :test #'string=) (rule-with-number (rules-with-state delta state)))
	 (target-state (rule-with-number (rules-with-state delta state))))
	(t nil))))

  (defun apply-delta-string-aux (delta state input end-state position)
    "Apply delta on a string"
    (cond ((equal state end-state) (list t position))
	  ((equal state nil) (list nil (if (> position 1) (1- position) position)))
	  (t (apply-delta-string-aux delta (apply-delta-char delta state (subseq input 0 1)) (subseq input 1) end-state (1+ position)))))

  (defun apply-delta-string (delta state input end-state)
    (apply-delta-string-aux delta state (concatenate 'string input (princ-to-string (code-char 1))) end-state 0))

  (defun apply-on-automaton (automaton input)
    "Run the automaton on the input string and return the list of matches"
    (let ((i 0) (matches '()))
      (loop while (< i (length input))
	    do
	       ;; (format t "~a~%" (subseq input i))
	       (destructuring-bind (result char-read)
		   (apply-delta-string
		    (automaton-delta automaton)
		    (automaton-init automaton)
		    (subseq input i)
		    (automaton-end automaton))
		 ;; (format t "char read: ~a~%" char-read)
		 (cond
		   (result
		     (setq matches (append matches (list (subseq input i (+ i char-read)))))
		     (incf i char-read))
		   (t (incf i char-read)))))
	  matches))

  (defun check-multiple-automaton (automaton-list input)
    (let ((max 0))
      (loop for automaton in automaton-list do
	(let ((possible-match
		(apply-delta-string
		 (automaton-delta automaton)
		 (automaton-init automaton)
		 input
		 (automaton-end automaton))))
	  (cond
	    ((first possible-match) (return-from check-multiple-automaton possible-match))
	    (t (if (> (second possible-match) max) (setq max (second possible-match)))))
	  ))
      (list nil max)))

  (defun apply-on-automaton-list (automaton-list input)
    "Run the automaton on the input string and return the list of matches"
    (let ((i 0) (matches '()))
      (loop while (< i (length input))
	    do
	       (destructuring-bind
		   (result char-read)
		   (check-multiple-automaton automaton-list (subseq input i))
		 (cond
		   (result
		    (setq matches (append matches (list (subseq input i (+ i char-read)))))
		    (incf i char-read))
		   (t (incf i char-read)))))
      matches))

  (defun compile-regex (regex)
    (let ((delta
	    (loop for index from 0
		  for char across regex
		  collect (list index '- char '-> (1+ index)))))
      (make-automaton :init 0 :end (length regex) :delta delta)))


  (defun regex-match-all (regex input)
    (apply-on-automaton (compile-regex regex) input))



  ;;; (let+ ((a 1)
  ;;;        ((b c) (list 1 2))))
  ;;; 
  ;;; should expand into
  ;;; 
  ;;; (let ((a 1))
  ;;;   (destructuring-bind (b c) (list 1 2)))

  (defmacro let+ (bindings &body body)
    "Allows to implicitly mix let and destructuring-bind inside a single let+ call.
  For normal let the syntax stays the same, while for a destructuring-bind the syntax is
  (let+ (((a b) '(1 2)))) which is like (destructuring-bind (a b) '(1 2))."
    (let ((stack nil)
	  (compiled nil))
      (loop for binding in bindings
	    if (listp (car binding)) ; multiple symbols to bind
	      do (push `(destructuring-bind ,@binding) stack)
	    else ; normal let
	      do (push `(let ,(list binding)) stack))
      ;; last binding gets the actual body
      (setf compiled (append (pop stack) body))
      (loop while stack ; build the nested expression by unwinding the stack
	    do (setf compiled (append (pop stack) (list compiled))))
      compiled))

  (defun compare-lists (list1 list2 &optional (pred #'<))
    "Execute pred on each pair of elements of list1 and list2 and return non-NIL if is to precede list2."
    (loop for x in list1 for y in list2 when (not (equal x y)) return (funcall pred x y)))


  (defun string* (string times)
    (let ((product ""))
      (dotimes (i times product)
	(setf product (concatenate 'string product string)))))

  (defun memoize (fn)
    (let ((cache (make-hash-table :test #'equal)))
	  #'(lambda (&rest args)
	      (multiple-value-bind
		    (result in-cache)
		  (gethash args cache)
		  (if in-cache
		      result
		      (setf (gethash args cache)
			    (apply fn args)))))))

  (defun apply-memoization (fname)
    (setf (fdefinition fname) (memoize (symbol-function fname))))
#+end_src

#+RESULTS:
: COMMON-LISP-USER::COMPARE-LISTS
